[Killed] BlockStatement
src/policy.ts:11:48
   /** Rules comprising policy. */
   readonly rules: Rule[]
 
-  constructor (name: string, ...rules: Rule[]) {
-    this.name = name
-    this.rules = rules
-  }
+  constructor (name: string, ...rules: Rule[]) {}
 
   /** Add rules to a policy. */
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


PASS test/matcher.ts

  matcher

[Killed] BlockStatement
src/policy.ts:17:35
   }
 
   /** Add rules to a policy. */
-  push (...rules: Rule[]): Policy {
-    this.rules.push(...rules)
-    return this
-  }
+  push (...rules: Rule[]): Policy {}
 
   /** Check whether an action is allowed on a path.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BlockStatement
src/policy.ts:30:74
     *          `false` if the action is explicitly denied, or
     *          `null` if the combination of path and action
     *          is not governed by this policy. */
-  query (path: string, verb: string, ctx?: QueryContext): boolean | null {
-    let allow = null
-    for (const rule of this.rules) {
-      const res = rule.query(path, verb, ctx)
-      if (res === false) {
-        return false
-      }
-      if (res === true) {
-        allow = true
-      }
-    }
-    return allow
-  }
+  query (path: string, verb: string, ctx?: QueryContext): boolean | null {}
 
   /** Check whether a path is governed by this policy.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy
    ✓ matches paths correctly (1 ms)

[Killed] BlockStatement
src/policy.ts:32:36
     *          is not governed by this policy. */
   query (path: string, verb: string, ctx?: QueryContext): boolean | null {
     let allow = null
-    for (const rule of this.rules) {
-      const res = rule.query(path, verb, ctx)
-      if (res === false) {
-        return false
-      }
-      if (res === true) {
-        allow = true
-      }
-    }
+    for (const rule of this.rules) {}
     return allow
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] EqualityOperator
src/policy.ts:34:11
     let allow = null
     for (const rule of this.rules) {
       const res = rule.query(path, verb, ctx)
-      if (res === false) {
+      if (res !== false) {
         return false
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BlockStatement
src/policy.ts:34:26
     let allow = null
     for (const rule of this.rules) {
       const res = rule.query(path, verb, ctx)
-      if (res === false) {
-        return false
-      }
+      if (res === false) {}
       if (res === true) {
         allow = true
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BooleanLiteral
src/policy.ts:35:16
     for (const rule of this.rules) {
       const res = rule.query(path, verb, ctx)
       if (res === false) {
-        return false
+        return true
       }
       if (res === true) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BooleanLiteral
src/policy.ts:37:19
       if (res === false) {
         return false
       }
-      if (res === true) {
+      if (res === false) {
         allow = true
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] ConditionalExpression
src/policy.ts:37:11
       if (res === false) {
         return false
       }
-      if (res === true) {
+      if (true) {
         allow = true
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BooleanLiteral
src/policy.ts:38:17
         return false
       }
       if (res === true) {
-        allow = true
+        allow = false
       }
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BlockStatement
src/policy.ts:47:55
   /** Check whether a path is governed by this policy.
     * @param path Path to be checked.
     * @param ctx Query context for resolving context-dependent paths. */
-  matches (path: string, ctx?: QueryContext): boolean {
-    for (const rule of this.rules) {
-      if (rule.matches(path, ctx)) {
-        return true
-      }
-    }
-    return false
-  }
+  matches (path: string, ctx?: QueryContext): boolean {}
 
   /** Create clone of a policy.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BlockStatement
src/policy.ts:48:36
     * @param path Path to be checked.
     * @param ctx Query context for resolving context-dependent paths. */
   matches (path: string, ctx?: QueryContext): boolean {
-    for (const rule of this.rules) {
-      if (rule.matches(path, ctx)) {
-        return true
-      }
-    }
+    for (const rule of this.rules) {}
     return false
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] ConditionalExpression
src/policy.ts:49:11
     * @param ctx Query context for resolving context-dependent paths. */
   matches (path: string, ctx?: QueryContext): boolean {
     for (const rule of this.rules) {
-      if (rule.matches(path, ctx)) {
+      if (true) {
         return true
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] ConditionalExpression
src/policy.ts:49:11
     * @param ctx Query context for resolving context-dependent paths. */
   matches (path: string, ctx?: QueryContext): boolean {
     for (const rule of this.rules) {
-      if (rule.matches(path, ctx)) {
+      if (false) {
         return true
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BooleanLiteral
src/policy.ts:50:16
   matches (path: string, ctx?: QueryContext): boolean {
     for (const rule of this.rules) {
       if (rule.matches(path, ctx)) {
-        return true
+        return false
       }
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BlockStatement
src/policy.ts:59:66
   /** Create clone of a policy.
     * @param name Replacement name for new policy.
     * @param deep Deep copy; clone underlying rules as well. */
-  clone (name: string = this.name, deep: boolean = true): Policy {
-    return deep
-      ? new Policy(name, ...this.rules.map((rule) => rule.clone()))
-      : new Policy(name, ...this.rules)
-  }
+  clone (name: string = this.name, deep: boolean = true): Policy {}
 
   /** Static constructor function; returns a new Policy. */
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Survived] BooleanLiteral
src/policy.ts:59:52
   /** Create clone of a policy.
     * @param name Replacement name for new policy.
     * @param deep Deep copy; clone underlying rules as well. */
-  clone (name: string = this.name, deep: boolean = true): Policy {
+  clone (name: string = this.name, deep: boolean = false): Policy {
     return deep
       ? new Policy(name, ...this.rules.map((rule) => rule.clone()))

[Killed] ArrowFunction
src/policy.ts:61:44
     * @param deep Deep copy; clone underlying rules as well. */
   clone (name: string = this.name, deep: boolean = true): Policy {
     return deep
-      ? new Policy(name, ...this.rules.map((rule) => rule.clone()))
+      ? new Policy(name, ...this.rules.map(() => undefined))
       : new Policy(name, ...this.rules)
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy

[Killed] BlockStatement
src/policy.ts:66:55
   }
 
   /** Static constructor function; returns a new Policy. */
-  static for (name: string, ...rules: Rule[]): Policy {
-    return new Policy(name, ...rules)
-  }
+  static for (name: string, ...rules: Rule[]): Policy {}
 }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policy.ts

  policy
