[Killed] BlockStatement
src/build-country.js:3:48
 let timezonesMap;
 
-export default function buildCountry(data, id) {
-  const name = data.countries[id];
-  if (!name) return null;
-
-  const tzMap = getTimezonesMap(data)[id] || {};
-
-  return {
-    id,
-    name,
-    timezones: tzMap.current || [],
-    allTimezones: tzMap.all || [],
-  };
-}
+export default function buildCountry(data, id) {}
 
 function getTimezonesMap(data) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/build-country.js:5:7
 
 export default function buildCountry(data, id) {
   const name = data.countries[id];
-  if (!name) return null;
+  if (name) return null;
 
   const tzMap = getTimezonesMap(data)[id] || {};
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:5:7
 
 export default function buildCountry(data, id) {
   const name = data.countries[id];
-  if (!name) return null;
+  if (false) return null;
 
   const tzMap = getTimezonesMap(data)[id] || {};
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] LogicalOperator
src/build-country.js:7:17
   const name = data.countries[id];
   if (!name) return null;
 
-  const tzMap = getTimezonesMap(data)[id] || {};
+  const tzMap = getTimezonesMap(data)[id] && {};
 
   return {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:7:17
   const name = data.countries[id];
   if (!name) return null;
 
-  const tzMap = getTimezonesMap(data)[id] || {};
+  const tzMap = false;
 
   return {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ObjectLiteral
src/build-country.js:9:10
 
   const tzMap = getTimezonesMap(data)[id] || {};
 
-  return {
-    id,
-    name,
-    timezones: tzMap.current || [],
-    allTimezones: tzMap.all || [],
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] LogicalOperator
src/build-country.js:12:16
   return {
     id,
     name,
-    timezones: tzMap.current || [],
+    timezones: tzMap.current && [],
     allTimezones: tzMap.all || [],
   };
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:12:16
   return {
     id,
     name,
-    timezones: tzMap.current || [],
+    timezones: false,
     allTimezones: tzMap.all || [],
   };
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:13:19
     id,
     name,
     timezones: tzMap.current || [],
-    allTimezones: tzMap.all || [],
+    allTimezones: true,
   };
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] LogicalOperator
src/build-country.js:13:19
     id,
     name,
     timezones: tzMap.current || [],
-    allTimezones: tzMap.all || [],
+    allTimezones: tzMap.all && [],
   };
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/build-country.js:17:32
   };
 }
 
-function getTimezonesMap(data) {
-  if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
-  return timezonesMap;
-}
+function getTimezonesMap(data) {}
 
 function buildTimezonesMap(data) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/build-country.js:18:7
 }
 
 function getTimezonesMap(data) {
-  if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+  if (timezonesMap) timezonesMap = buildTimezonesMap(data);
   return timezonesMap;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:18:7
 }
 
 function getTimezonesMap(data) {
-  if (!timezonesMap) timezonesMap = buildTimezonesMap(data);
+  if (false) timezonesMap = buildTimezonesMap(data);
   return timezonesMap;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/build-country.js:22:34
   return timezonesMap;
 }
 
-function buildTimezonesMap(data) {
-  return Object.keys(data.timezones).reduce((result, id) => {
-    const tz = data.timezones[id];
-    const { c, a } = tz;
-    const aliasTz = data.timezones[a] || {};
-    const countries = c || aliasTz.c;
-
-    if (!countries) return result;
-
-    countries.forEach((country) => {
-      if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
-      if (tz.r === undefined) result[country].current.push(id);
-      result[country].all.push(id);
-    });
-
-    return result;
-  }, {});
-}
+function buildTimezonesMap(data) {}
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/build-country.js:23:61
 }
 
 function buildTimezonesMap(data) {
-  return Object.keys(data.timezones).reduce((result, id) => {
-    const tz = data.timezones[id];
-    const { c, a } = tz;
-    const aliasTz = data.timezones[a] || {};
-    const countries = c || aliasTz.c;
-
-    if (!countries) return result;
-
-    countries.forEach((country) => {
-      if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
-      if (tz.r === undefined) result[country].current.push(id);
-      result[country].all.push(id);
-    });
-
-    return result;
-  }, {});
+  return Object.keys(data.timezones).reduce((result, id) => {}, {});
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:26:21
   return Object.keys(data.timezones).reduce((result, id) => {
     const tz = data.timezones[id];
     const { c, a } = tz;
-    const aliasTz = data.timezones[a] || {};
+    const aliasTz = true;
     const countries = c || aliasTz.c;
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:26:21
   return Object.keys(data.timezones).reduce((result, id) => {
     const tz = data.timezones[id];
     const { c, a } = tz;
-    const aliasTz = data.timezones[a] || {};
+    const aliasTz = false;
     const countries = c || aliasTz.c;
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:27:23
     const tz = data.timezones[id];
     const { c, a } = tz;
     const aliasTz = data.timezones[a] || {};
-    const countries = c || aliasTz.c;
+    const countries = true;
 
     if (!countries) return result;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:27:23
     const tz = data.timezones[id];
     const { c, a } = tz;
     const aliasTz = data.timezones[a] || {};
-    const countries = c || aliasTz.c;
+    const countries = false;
 
     if (!countries) return result;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:29:9
     const aliasTz = data.timezones[a] || {};
     const countries = c || aliasTz.c;
 
-    if (!countries) return result;
+    if (false) return result;
 
     countries.forEach((country) => {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/build-country.js:29:9
     const aliasTz = data.timezones[a] || {};
     const countries = c || aliasTz.c;
 
-    if (!countries) return result;
+    if (countries) return result;
 
     countries.forEach((country) => {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/build-country.js:31:36
 
     if (!countries) return result;
 
-    countries.forEach((country) => {
-      if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
-      if (tz.r === undefined) result[country].current.push(id);
-      result[country].all.push(id);
-    });
+    countries.forEach((country) => {});
 
     return result;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/build-country.js:32:11
     if (!countries) return result;
 
     countries.forEach((country) => {
-      if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+      if (result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
       if (tz.r === undefined) result[country].current.push(id);
       result[country].all.push(id);
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:32:11
     if (!countries) return result;
 
     countries.forEach((country) => {
-      if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
+      if (false) Object.assign(result, { [country]: { current: [], all: [] } });
       if (tz.r === undefined) result[country].current.push(id);
       result[country].all.push(id);
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:33:11
 
     countries.forEach((country) => {
       if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
-      if (tz.r === undefined) result[country].current.push(id);
+      if (true) result[country].current.push(id);
       result[country].all.push(id);
     });
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-country.js:33:11
 
     countries.forEach((country) => {
       if (!result[country]) Object.assign(result, { [country]: { current: [], all: [] } });
-      if (tz.r === undefined) result[country].current.push(id);
+      if (false) result[country].current.push(id);
       result[country].all.push(id);
     });
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha
