[Killed] BlockStatement
src/rule.ts:14:40
 
   /** @param spec Path specification or pre-compiled matcher for
     *             determining which paths this rule will apply to. */
-  constructor (spec: string | Matcher) {
-    this.regex = spec instanceof Matcher
-      ? spec
-      : new Matcher(spec)
-  }
+  constructor (spec: string | Matcher) {}
 
   /** Mark one or more verbs as allowed.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BlockStatement
src/rule.ts:24:36
     * @note Deny overrides allow within SPACL policies;
     *       this method will have no effect on verbs
     *       previously marked as denied. */
-  allow (...verbs: string[]): Rule {
-    for (const verb of verbs) {
-      if (!(verb in this.verbs)) {
-        this.verbs[verb] = true
-      }
-    }
-    return this
-  }
+  allow (...verbs: string[]): Rule {}
 
   /** Mark one or more verbs as denied. */
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BlockStatement
src/rule.ts:25:31
     *       this method will have no effect on verbs
     *       previously marked as denied. */
   allow (...verbs: string[]): Rule {
-    for (const verb of verbs) {
-      if (!(verb in this.verbs)) {
-        this.verbs[verb] = true
-      }
-    }
+    for (const verb of verbs) {}
     return this
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BooleanLiteral
src/rule.ts:26:11
     *       previously marked as denied. */
   allow (...verbs: string[]): Rule {
     for (const verb of verbs) {
-      if (!(verb in this.verbs)) {
+      if (verb in this.verbs) {
         this.verbs[verb] = true
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] ConditionalExpression
src/rule.ts:26:11
     *       previously marked as denied. */
   allow (...verbs: string[]): Rule {
     for (const verb of verbs) {
-      if (!(verb in this.verbs)) {
+      if (true) {
         this.verbs[verb] = true
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


PASS test/policymap.ts

  policymap

[Killed] BooleanLiteral
src/rule.ts:27:28
   allow (...verbs: string[]): Rule {
     for (const verb of verbs) {
       if (!(verb in this.verbs)) {
-        this.verbs[verb] = true
+        this.verbs[verb] = false
       }
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:34:35
   }
 
   /** Mark one or more verbs as denied. */
-  deny (...verbs: string[]): Rule {
-    for (const verb of verbs) {
-      this.verbs[verb] = false
-    }
-    return this
-  }
+  deny (...verbs: string[]): Rule {}
 
   /** Check whether an action is allowed on a path.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:35:31
 
   /** Mark one or more verbs as denied. */
   deny (...verbs: string[]): Rule {
-    for (const verb of verbs) {
-      this.verbs[verb] = false
-    }
+    for (const verb of verbs) {}
     return this
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BooleanLiteral
src/rule.ts:36:26
   /** Mark one or more verbs as denied. */
   deny (...verbs: string[]): Rule {
     for (const verb of verbs) {
-      this.verbs[verb] = false
+      this.verbs[verb] = true
     }
     return this
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:49:74
     *          `false` if the action is explicitly denied, or
     *          `null` if the combination of path and action
     *          is not governed by this rule. */
-  query (path: string, verb: string, ctx?: QueryContext): boolean | null {
-    if (this.matches(path, ctx) && verb in this.verbs) {
-      return this.verbs[verb]
-    }
-    return null
-  }
+  query (path: string, verb: string, ctx?: QueryContext): boolean | null {}
 
   /** Check whether a path is governed by this rule.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] LogicalOperator
src/rule.ts:50:9
     *          `null` if the combination of path and action
     *          is not governed by this rule. */
   query (path: string, verb: string, ctx?: QueryContext): boolean | null {
-    if (this.matches(path, ctx) && verb in this.verbs) {
+    if (this.matches(path, ctx) || verb in this.verbs) {
       return this.verbs[verb]
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:50:56
     *          `null` if the combination of path and action
     *          is not governed by this rule. */
   query (path: string, verb: string, ctx?: QueryContext): boolean | null {
-    if (this.matches(path, ctx) && verb in this.verbs) {
-      return this.verbs[verb]
-    }
+    if (this.matches(path, ctx) && verb in this.verbs) {}
     return null
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:59:55
   /** Check whether a path is governed by this rule.
     * @param path Path to be checked.
     * @param ctx Query context for resolving context-dependent paths. */
-  matches (path: string, ctx?: QueryContext): boolean {
-    const match = path.match(this.regex)
-    if (match === null) {
-      return false
-    }
-    const count = this.regex.props.length
-    if (count > 0) {
-      if (ctx === undefined) {
-        return false
-      }
-      for (let index = 0; index < count; index++) {
-        const prop = ctx[this.regex.props[index]]
-        if (prop === undefined || match[index + 1] !== prop) {
-          return false
-        }
-      }
-    }
-    return true
-  }
+  matches (path: string, ctx?: QueryContext): boolean {}
 
   /** Create clone of a rule.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] ConditionalExpression
src/rule.ts:61:9
     * @param ctx Query context for resolving context-dependent paths. */
   matches (path: string, ctx?: QueryContext): boolean {
     const match = path.match(this.regex)
-    if (match === null) {
+    if (false) {
       return false
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:61:25
     * @param ctx Query context for resolving context-dependent paths. */
   matches (path: string, ctx?: QueryContext): boolean {
     const match = path.match(this.regex)
-    if (match === null) {
-      return false
-    }
+    if (match === null) {}
     const count = this.regex.props.length
     if (count > 0) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BooleanLiteral
src/rule.ts:62:14
   matches (path: string, ctx?: QueryContext): boolean {
     const match = path.match(this.regex)
     if (match === null) {
-      return false
+      return true
     }
     const count = this.regex.props.length
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] ConditionalExpression
src/rule.ts:65:9
       return false
     }
     const count = this.regex.props.length
-    if (count > 0) {
+    if (true) {
       if (ctx === undefined) {
         return false
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] EqualityOperator
src/rule.ts:65:9
       return false
     }
     const count = this.regex.props.length
-    if (count > 0) {
+    if (count >= 0) {
       if (ctx === undefined) {
         return false
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] ConditionalExpression
src/rule.ts:66:11
     }
     const count = this.regex.props.length
     if (count > 0) {
-      if (ctx === undefined) {
+      if (false) {
         return false
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:66:30
     }
     const count = this.regex.props.length
     if (count > 0) {
-      if (ctx === undefined) {
-        return false
-      }
+      if (ctx === undefined) {}
       for (let index = 0; index < count; index++) {
         const prop = ctx[this.regex.props[index]]
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BooleanLiteral
src/rule.ts:67:16
     const count = this.regex.props.length
     if (count > 0) {
       if (ctx === undefined) {
-        return false
+        return true
       }
       for (let index = 0; index < count; index++) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] UpdateOperator
src/rule.ts:69:42
       if (ctx === undefined) {
         return false
       }
-      for (let index = 0; index < count; index++) {
+      for (let index = 0; index < count; index--) {
         const prop = ctx[this.regex.props[index]]
         if (prop === undefined || match[index + 1] !== prop) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] EqualityOperator
src/rule.ts:69:27
       if (ctx === undefined) {
         return false
       }
-      for (let index = 0; index < count; index++) {
+      for (let index = 0; index <= count; index++) {
         const prop = ctx[this.regex.props[index]]
         if (prop === undefined || match[index + 1] !== prop) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] ArithmeticOperator
src/rule.ts:71:41
       }
       for (let index = 0; index < count; index++) {
         const prop = ctx[this.regex.props[index]]
-        if (prop === undefined || match[index + 1] !== prop) {
+        if (prop === undefined || match[index - 1] !== prop) {
           return false
         }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] LogicalOperator
src/rule.ts:71:13
       }
       for (let index = 0; index < count; index++) {
         const prop = ctx[this.regex.props[index]]
-        if (prop === undefined || match[index + 1] !== prop) {
+        if (prop === undefined && match[index + 1] !== prop) {
           return false
         }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BooleanLiteral
src/rule.ts:72:18
       for (let index = 0; index < count; index++) {
         const prop = ctx[this.regex.props[index]]
         if (prop === undefined || match[index + 1] !== prop) {
-          return false
+          return true
         }
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:81:53
 
   /** Create clone of a rule.
     * @param spec Replacement path specification for the new rule. */
-  clone (spec: string | Matcher = this.regex): Rule {
-    const rule = new Rule(spec)
-    for (const verb in this.verbs) {
-      rule.verbs[verb] = this.verbs[verb]
-    }
-    return rule
-  }
+  clone (spec: string | Matcher = this.regex): Rule {}
 
   /** Static constructor function; returns a new Rule.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:83:36
     * @param spec Replacement path specification for the new rule. */
   clone (spec: string | Matcher = this.regex): Rule {
     const rule = new Rule(spec)
-    for (const verb in this.verbs) {
-      rule.verbs[verb] = this.verbs[verb]
-    }
+    for (const verb in this.verbs) {}
     return rule
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule

[Killed] BlockStatement
src/rule.ts:92:45
   /** Static constructor function; returns a new Rule.
     * @param spec Path specification or pre-compiled matcher for
     *             determining which paths this rule will apply to. */
-  static for (spec: string | Matcher): Rule {
-    return new Rule(spec)
-  }
+  static for (spec: string | Matcher): Rule {}
 }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/rule.ts

  rule
