[Killed] ConditionalExpression
src/build-timezone.js:3:7
 export default function buildTimezone(data, name) {
   const timezone = data.timezones[name];
-  if (!timezone) return null;
+  if (true) return null;
 
   const { a: aliasOf = null } = timezone;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/build-timezone.js:3:7
 export default function buildTimezone(data, name) {
   const timezone = data.timezones[name];
-  if (!timezone) return null;
+  if (timezone) return null;
 
   const { a: aliasOf = null } = timezone;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-timezone.js:12:21
     ...data.timezones[name],
   };
 
-  const countries = tz.c || [];
+  const countries = false;
   const utcOffset = tz.u;
   const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] LogicalOperator
src/build-timezone.js:12:21
     ...data.timezones[name],
   };
 
-  const countries = tz.c || [];
+  const countries = tz.c && [];
   const utcOffset = tz.u;
   const dstOffset = Number.isInteger(tz.d) ? tz.d : utcOffset;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/build-timezone.js:25:39
     dstOffsetStr: getOffsetStr(dstOffset),
     aliasOf,
   };
-  if (timezone.r) result.deprecated = true;
+  if (timezone.r) result.deprecated = false;
   return result;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-timezone.js:25:7
     dstOffsetStr: getOffsetStr(dstOffset),
     aliasOf,
   };
-  if (timezone.r) result.deprecated = true;
+  if (true) result.deprecated = true;
   return result;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/build-timezone.js:29:31
   return result;
 }
 
-function getOffsetStr(offset) {
-  const hours = Math.floor(offset / 60);
-  const min = offset % 60;
-  const sign = offset < 0 ? '-' : '+';
-
-  return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
-}
+function getOffsetStr(offset) {}
 
 function getNumStr(input) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ArithmeticOperator
src/build-timezone.js:30:28
 }
 
 function getOffsetStr(offset) {
-  const hours = Math.floor(offset / 60);
+  const hours = Math.floor(offset * 60);
   const min = offset % 60;
   const sign = offset < 0 ? '-' : '+';
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ArithmeticOperator
src/build-timezone.js:31:15
 
 function getOffsetStr(offset) {
   const hours = Math.floor(offset / 60);
-  const min = offset % 60;
+  const min = offset * 60;
   const sign = offset < 0 ? '-' : '+';
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-timezone.js:32:16
 function getOffsetStr(offset) {
   const hours = Math.floor(offset / 60);
   const min = offset % 60;
-  const sign = offset < 0 ? '-' : '+';
+  const sign = true ? '-' : '+';
 
   return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] EqualityOperator
src/build-timezone.js:32:16
 function getOffsetStr(offset) {
   const hours = Math.floor(offset / 60);
   const min = offset % 60;
-  const sign = offset < 0 ? '-' : '+';
+  const sign = offset <= 0 ? '-' : '+';
 
   return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] StringLiteral
src/build-timezone.js:34:10
   const min = offset % 60;
   const sign = offset < 0 ? '-' : '+';
 
-  return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
+  return ``;
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/build-timezone.js:37:27
   return `${sign}${getNumStr(hours)}:${getNumStr(min)}`;
 }
 
-function getNumStr(input) {
-  const num = Math.abs(input);
-  const prefix = num < 10 ? '0' : '';
-  return `${prefix}${num}`;
-}
+function getNumStr(input) {}
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/build-timezone.js:39:18
 
 function getNumStr(input) {
   const num = Math.abs(input);
-  const prefix = num < 10 ? '0' : '';
+  const prefix = true ? '0' : '';
   return `${prefix}${num}`;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] EqualityOperator
src/build-timezone.js:39:18
 
 function getNumStr(input) {
   const num = Math.abs(input);
-  const prefix = num < 10 ? '0' : '';
+  const prefix = num <= 10 ? '0' : '';
   return `${prefix}${num}`;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] StringLiteral
src/build-timezone.js:40:10
 function getNumStr(input) {
   const num = Math.abs(input);
   const prefix = num < 10 ? '0' : '';
-  return `${prefix}${num}`;
+  return ``;
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha
