[Killed] BlockStatement
src/index.js:10:47
 const timezones = {};
 let memoizedTimezones = 0;
 
-export function getAllCountries(options = {}) {
-  return Object.keys(data.countries).reduce((prev, id) => {
-    return Object.assign(prev, { [id]: getCountry(id, options) });
-  }, {});
-}
+export function getAllCountries(options = {}) {}
 
 export function getAllTimezones(options = {}) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:11:59
 let memoizedTimezones = 0;
 
 export function getAllCountries(options = {}) {
-  return Object.keys(data.countries).reduce((prev, id) => {
-    return Object.assign(prev, { [id]: getCountry(id, options) });
-  }, {});
+  return Object.keys(data.countries).reduce((prev, id) => {}, {});
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:16:47
   }, {});
 }
 
-export function getAllTimezones(options = {}) {
-  if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
-  return deliverTimezones(timezones, options);
-}
+export function getAllTimezones(options = {}) {}
 
 export function getCountry(id, options = {}) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] EqualityOperator
src/index.js:17:7
 }
 
 export function getAllTimezones(options = {}) {
-  if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+  if (totalTimezones === memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
   return deliverTimezones(timezones, options);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:17:7
 }
 
 export function getAllTimezones(options = {}) {
-  if (totalTimezones !== memoizedTimezones) Object.keys(data.timezones).forEach(getTimezone);
+  if (false) Object.keys(data.timezones).forEach(getTimezone);
   return deliverTimezones(timezones, options);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:21:46
   return deliverTimezones(timezones, options);
 }
 
-export function getCountry(id, options = {}) {
-  if (!countries[id]) memoizeCountry(buildCountry(data, id));
-  return deliverCountry(countries[id], options);
-}
+export function getCountry(id, options = {}) {}
 
 function memoizeCountry(country) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:22:7
 }
 
 export function getCountry(id, options = {}) {
-  if (!countries[id]) memoizeCountry(buildCountry(data, id));
+  if (true) memoizeCountry(buildCountry(data, id));
   return deliverCountry(countries[id], options);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:22:7
 }
 
 export function getCountry(id, options = {}) {
-  if (!countries[id]) memoizeCountry(buildCountry(data, id));
+  if (false) memoizeCountry(buildCountry(data, id));
   return deliverCountry(countries[id], options);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:26:34
   return deliverCountry(countries[id], options);
 }
 
-function memoizeCountry(country) {
-  if (!country) return;
-  countries[country.id] = country;
-}
+function memoizeCountry(country) {}
 
 export function getTimezone(name) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/index.js:27:7
 }
 
 function memoizeCountry(country) {
-  if (!country) return;
+  if (country) return;
   countries[country.id] = country;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:27:7
 }
 
 function memoizeCountry(country) {
-  if (!country) return;
+  if (false) return;
   countries[country.id] = country;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:31:35
   countries[country.id] = country;
 }
 
-export function getTimezone(name) {
-  if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
-  return timezones[name] ? { ...timezones[name] } : null;
-}
+export function getTimezone(name) {}
 
 function memoizeTimezone(timezone) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:32:7
 }
 
 export function getTimezone(name) {
-  if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+  if (true) memoizeTimezone(buildTimezone(data, name));
   return timezones[name] ? { ...timezones[name] } : null;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:32:7
 }
 
 export function getTimezone(name) {
-  if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
+  if (false) memoizeTimezone(buildTimezone(data, name));
   return timezones[name] ? { ...timezones[name] } : null;
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ObjectLiteral
src/index.js:33:28
 
 export function getTimezone(name) {
   if (!timezones[name]) memoizeTimezone(buildTimezone(data, name));
-  return timezones[name] ? { ...timezones[name] } : null;
+  return timezones[name] ? {} : null;
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:36:36
   return timezones[name] ? { ...timezones[name] } : null;
 }
 
-function memoizeTimezone(timezone) {
-  if (!timezone) return;
-  timezones[timezone.name] = timezone;
-  memoizedTimezones = Object.keys(timezone).length;
-}
+function memoizeTimezone(timezone) {}
 
 export function getCountriesForTimezone(tzName, options = {}) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:37:7
 }
 
 function memoizeTimezone(timezone) {
-  if (!timezone) return;
+  if (true) return;
   timezones[timezone.name] = timezone;
   memoizedTimezones = Object.keys(timezone).length;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:37:7
 }
 
 function memoizeTimezone(timezone) {
-  if (!timezone) return;
+  if (false) return;
   timezones[timezone.name] = timezone;
   memoizedTimezones = Object.keys(timezone).length;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:42:63
   memoizedTimezones = Object.keys(timezone).length;
 }
 
-export function getCountriesForTimezone(tzName, options = {}) {
-  const timezone = getTimezone(tzName) || {};
-  const values = timezone.countries || [];
-  return values.map((c) => getCountry(c, options));
-}
+export function getCountriesForTimezone(tzName, options = {}) {}
 
 export function getCountryForTimezone(tzName, options = {}) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:43:20
 }
 
 export function getCountriesForTimezone(tzName, options = {}) {
-  const timezone = getTimezone(tzName) || {};
+  const timezone = true;
   const values = timezone.countries || [];
   return values.map((c) => getCountry(c, options));
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] LogicalOperator
src/index.js:43:20
 }
 
 export function getCountriesForTimezone(tzName, options = {}) {
-  const timezone = getTimezone(tzName) || {};
+  const timezone = getTimezone(tzName) && {};
   const values = timezone.countries || [];
   return values.map((c) => getCountry(c, options));
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:44:18
 
 export function getCountriesForTimezone(tzName, options = {}) {
   const timezone = getTimezone(tzName) || {};
-  const values = timezone.countries || [];
+  const values = false;
   return values.map((c) => getCountry(c, options));
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:44:18
 
 export function getCountriesForTimezone(tzName, options = {}) {
   const timezone = getTimezone(tzName) || {};
-  const values = timezone.countries || [];
+  const values = true;
   return values.map((c) => getCountry(c, options));
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ArrowFunction
src/index.js:45:21
 export function getCountriesForTimezone(tzName, options = {}) {
   const timezone = getTimezone(tzName) || {};
   const values = timezone.countries || [];
-  return values.map((c) => getCountry(c, options));
+  return values.map(() => undefined);
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:48:61
   return values.map((c) => getCountry(c, options));
 }
 
-export function getCountryForTimezone(tzName, options = {}) {
-  const [main] = getCountriesForTimezone(tzName, options);
-  return main || null;
-}
+export function getCountryForTimezone(tzName, options = {}) {}
 
 export function getTimezonesForCountry(countryId, options = {}) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:50:10
 
 export function getCountryForTimezone(tzName, options = {}) {
   const [main] = getCountriesForTimezone(tzName, options);
-  return main || null;
+  return true;
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:50:10
 
 export function getCountryForTimezone(tzName, options = {}) {
   const [main] = getCountriesForTimezone(tzName, options);
-  return main || null;
+  return false;
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:53:65
   return main || null;
 }
 
-export function getTimezonesForCountry(countryId, options = {}) {
-  const country = getCountry(countryId, options);
-  if (!country) return null;
-  const values = country.timezones || [];
-  return values.map(getTimezone);
-}
+export function getTimezonesForCountry(countryId, options = {}) {}
 
 function deliverTimezones(tzs, options) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:55:7
 
 export function getTimezonesForCountry(countryId, options = {}) {
   const country = getCountry(countryId, options);
-  if (!country) return null;
+  if (false) return null;
   const values = country.timezones || [];
   return values.map(getTimezone);
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:55:7
 
 export function getTimezonesForCountry(countryId, options = {}) {
   const country = getCountry(countryId, options);
-  if (!country) return null;
+  if (true) return null;
   const values = country.timezones || [];
   return values.map(getTimezone);
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:56:18
 export function getTimezonesForCountry(countryId, options = {}) {
   const country = getCountry(countryId, options);
   if (!country) return null;
-  const values = country.timezones || [];
+  const values = false;
   return values.map(getTimezone);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:56:18
 export function getTimezonesForCountry(countryId, options = {}) {
   const country = getCountry(countryId, options);
   if (!country) return null;
-  const values = country.timezones || [];
+  const values = true;
   return values.map(getTimezone);
 }
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:60:41
   return values.map(getTimezone);
 }
 
-function deliverTimezones(tzs, options) {
-  const { deprecated } = options || {};
-  if (deprecated === true) return tzs;
-  return Object.keys(tzs).reduce((prev, key) => {
-    if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
-    return prev;
-  }, {});
-}
+function deliverTimezones(tzs, options) {}
 
 function deliverCountry(country, options) {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:61:26
 }
 
 function deliverTimezones(tzs, options) {
-  const { deprecated } = options || {};
+  const { deprecated } = false;
   if (deprecated === true) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] LogicalOperator
src/index.js:61:26
 }
 
 function deliverTimezones(tzs, options) {
-  const { deprecated } = options || {};
+  const { deprecated } = options && {};
   if (deprecated === true) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/index.js:62:22
 
 function deliverTimezones(tzs, options) {
   const { deprecated } = options || {};
-  if (deprecated === true) return tzs;
+  if (deprecated === false) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
     if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:62:7
 
 function deliverTimezones(tzs, options) {
   const { deprecated } = options || {};
-  if (deprecated === true) return tzs;
+  if (true) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
     if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:63:49
 function deliverTimezones(tzs, options) {
   const { deprecated } = options || {};
   if (deprecated === true) return tzs;
-  return Object.keys(tzs).reduce((prev, key) => {
-    if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
-    return prev;
-  }, {});
+  return Object.keys(tzs).reduce((prev, key) => {}, {});
 }
 
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:64:9
   const { deprecated } = options || {};
   if (deprecated === true) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
-    if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+    if (false) Object.assign(prev, { [key]: tzs[key] });
     return prev;
   }, {});
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/index.js:64:9
   const { deprecated } = options || {};
   if (deprecated === true) return tzs;
   return Object.keys(tzs).reduce((prev, key) => {
-    if (!tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
+    if (tzs[key].deprecated) Object.assign(prev, { [key]: tzs[key] });
     return prev;
   }, {});
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BlockStatement
src/index.js:69:43
   }, {});
 }
 
-function deliverCountry(country, options) {
-  if (!country) return null;
-  const { deprecated } = options || {};
-  const { allTimezones, ...other } = country;
-  const tz = deprecated ? country.allTimezones : country.timezones;
-  return { ...other, timezones: tz };
-}
+function deliverCountry(country, options) {}
 
 export default {
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] BooleanLiteral
src/index.js:70:7
 }
 
 function deliverCountry(country, options) {
-  if (!country) return null;
+  if (country) return null;
   const { deprecated } = options || {};
   const { allTimezones, ...other } = country;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:70:7
 }
 
 function deliverCountry(country, options) {
-  if (!country) return null;
+  if (false) return null;
   const { deprecated } = options || {};
   const { allTimezones, ...other } = country;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:71:26
 
 function deliverCountry(country, options) {
   if (!country) return null;
-  const { deprecated } = options || {};
+  const { deprecated } = true;
   const { allTimezones, ...other } = country;
   const tz = deprecated ? country.allTimezones : country.timezones;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha

[Killed] ConditionalExpression
src/index.js:71:26
 
 function deliverCountry(country, options) {
   if (!country) return null;
-  const { deprecated } = options || {};
+  const { deprecated } = false;
   const { allTimezones, ...other } = country;
   const tz = deprecated ? country.allTimezones : country.timezones;
killedBy: All tests
statusReason: > countries-and-timezones@3.5.1 test:unit
> mocha
