[Survived] ObjectLiteral
crawler-url-parser.js:5:34
 const psl = require('psl');
 const cheerio = require('cheerio');
 
-const result_normalize_options = {
-	removeDirectoryIndex: true,
-	removeTrailingSlash: true,
-	stripWWW: true,
-	stripFragment: true,
-	normalizeHttps: false,
-	normalizeProtocol: true,
-	removeQueryParameters: [/^utm_\w+/i, 'ref']
-}
+const result_normalize_options = {}
 
 function _has_illegal_chars(str) {

[Survived] BooleanLiteral
crawler-url-parser.js:6:24
 const cheerio = require('cheerio');
 
 const result_normalize_options = {
-	removeDirectoryIndex: true,
+	removeDirectoryIndex: false,
 	removeTrailingSlash: true,
 	stripWWW: true,

[Survived] BooleanLiteral
crawler-url-parser.js:7:23
 
 const result_normalize_options = {
 	removeDirectoryIndex: true,
-	removeTrailingSlash: true,
+	removeTrailingSlash: false,
 	stripWWW: true,
 	stripFragment: true,

[Survived] BooleanLiteral
crawler-url-parser.js:8:12
 const result_normalize_options = {
 	removeDirectoryIndex: true,
 	removeTrailingSlash: true,
-	stripWWW: true,
+	stripWWW: false,
 	stripFragment: true,
 	normalizeHttps: false,

[Survived] BooleanLiteral
crawler-url-parser.js:9:17
 	removeDirectoryIndex: true,
 	removeTrailingSlash: true,
 	stripWWW: true,
-	stripFragment: true,
+	stripFragment: false,
 	normalizeHttps: false,
 	normalizeProtocol: true,

[Survived] BooleanLiteral
crawler-url-parser.js:10:18
 	removeTrailingSlash: true,
 	stripWWW: true,
 	stripFragment: true,
-	normalizeHttps: false,
+	normalizeHttps: true,
 	normalizeProtocol: true,
 	removeQueryParameters: [/^utm_\w+/i, 'ref']

[Survived] BooleanLiteral
crawler-url-parser.js:11:21
 	stripWWW: true,
 	stripFragment: true,
 	normalizeHttps: false,
-	normalizeProtocol: true,
+	normalizeProtocol: false,
 	removeQueryParameters: [/^utm_\w+/i, 'ref']
 }

[Survived] Regex
crawler-url-parser.js:12:26
 	stripFragment: true,
 	normalizeHttps: false,
 	normalizeProtocol: true,
-	removeQueryParameters: [/^utm_\w+/i, 'ref']
+	removeQueryParameters: [/utm_\w+/i, 'ref']
 }
 

[Survived] Regex
crawler-url-parser.js:12:26
 	stripFragment: true,
 	normalizeHttps: false,
 	normalizeProtocol: true,
-	removeQueryParameters: [/^utm_\w+/i, 'ref']
+	removeQueryParameters: [/^utm_\W+/i, 'ref']
 }
 

[Killed] BlockStatement
crawler-url-parser.js:15:34
 	removeQueryParameters: [/^utm_\w+/i, 'ref']
 }
 
-function _has_illegal_chars(str) {
-	return /[^a-z0-9\:\/\?\#\[\]\@\!\$\&\'\(\)\*\+\,\;\=\.\-\_\~\%]/i.test(str);
-}
+function _has_illegal_chars(str) {}
 
 function parse(currentUrlStr, baseUrlStr) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] Regex
crawler-url-parser.js:16:9
 }
 
 function _has_illegal_chars(str) {
-	return /[^a-z0-9\:\/\?\#\[\]\@\!\$\&\'\(\)\*\+\,\;\=\.\-\_\~\%]/i.test(str);
+	return /[a-z0-9\:\/\?\#\[\]\@\!\$\&\'\(\)\*\+\,\;\=\.\-\_\~\%]/i.test(str);
 }
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:31:6
 		search: null,
 		querycount: 0
 	}
-	if (typeof currentUrlStr === 'undefined') return null;
+	if (false) return null;
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:31:6
 		search: null,
 		querycount: 0
 	}
-	if (typeof currentUrlStr === 'undefined') return null;
+	if (true) return null;
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:32:6
 		querycount: 0
 	}
 	if (typeof currentUrlStr === 'undefined') return null;
-	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
+	if (false) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:32:6
 		querycount: 0
 	}
 	if (typeof currentUrlStr === 'undefined') return null;
-	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
+	if (true) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:33:6
 	}
 	if (typeof currentUrlStr === 'undefined') return null;
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
-	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
+	if (true) return null;
 
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:33:6
 	}
 	if (typeof currentUrlStr === 'undefined') return null;
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
-	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
+	if (false) return null;
 
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] Regex
crawler-url-parser.js:35:40
 	if (currentUrlStr && _has_illegal_chars(currentUrlStr)) return null;
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
-	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
+	currentUrlStr = currentUrlStr.replace(/\/\//, 'http://');
 	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] Regex
crawler-url-parser.js:36:40
 	if (baseUrlStr && _has_illegal_chars(baseUrlStr)) return null;
 
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
-	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
+	currentUrlStr = currentUrlStr.replace(/#.$/, '');
 
 	if (baseUrlStr) {

[Killed] ConditionalExpression
crawler-url-parser.js:38:6
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
 	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
 
-	if (baseUrlStr) {
+	if (false) {
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:38:18
 	currentUrlStr = currentUrlStr.replace(/^\/\//, 'http://');
 	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
 
-	if (baseUrlStr) {
-		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
-		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
-	} else {
+	if (baseUrlStr) {} else {
 		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
 			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] Regex
crawler-url-parser.js:39:35
 	currentUrlStr = currentUrlStr.replace(/#.*$/, '');
 
 	if (baseUrlStr) {
-		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
+		baseUrlStr = baseUrlStr.replace(/\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
 	} else {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:41:9
 	if (baseUrlStr) {
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
-	} else {
-		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
-			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
-		}
-	}
+	} else {}
 
 	let parsedUrl = URL.parse(currentUrlStr, true, true);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BooleanLiteral
crawler-url-parser.js:42:7
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
 	} else {
-		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
+		if (/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
 			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:42:57
 		baseUrlStr = baseUrlStr.replace(/^\/\//, 'http://');
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
 	} else {
-		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
-			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
-		}
+		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {}
 	}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] Regex
crawler-url-parser.js:43:42
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
 	} else {
 		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
-			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
+			currentUrlStr = currentUrlStr.replace(/^(?=(?:\w+:)?\/\/)/, 'http://');
 		}
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] StringLiteral
crawler-url-parser.js:43:64
 		baseUrlStr = baseUrlStr.replace(/#.*$/, '');
 	} else {
 		if (!/^\.*\/|^(?!localhost)\w+:/.test(currentUrlStr)) {
-			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, 'http://');
+			currentUrlStr = currentUrlStr.replace(/^(?!(?:\w+:)?\/\/)/, "");
 		}
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] BooleanLiteral
crawler-url-parser.js:47:43
 		}
 	}
 
-	let parsedUrl = URL.parse(currentUrlStr, true, true);
+	let parsedUrl = URL.parse(currentUrlStr, false, true);
 	delete parsedUrl.hash;
 

[Survived] BooleanLiteral
crawler-url-parser.js:47:49
 		}
 	}
 
-	let parsedUrl = URL.parse(currentUrlStr, true, true);
+	let parsedUrl = URL.parse(currentUrlStr, true, false);
 	delete parsedUrl.hash;
 

[Killed] LogicalOperator
crawler-url-parser.js:51:6
 	delete parsedUrl.hash;
 
 
-	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:') return null;
+	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' || parsedUrl.protocol != 'https:') return null;
 
 	//current url is relative like "abc", "/abc" or "../abc"
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] EqualityOperator
crawler-url-parser.js:51:61
 	delete parsedUrl.hash;
 
 
-	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:') return null;
+	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol == 'https:') return null;
 
 	//current url is relative like "abc", "/abc" or "../abc"
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:54:44
 	if (parsedUrl.protocol && parsedUrl.protocol != 'http:' && parsedUrl.protocol != 'https:') return null;
 
 	//current url is relative like "abc", "/abc" or "../abc"
-	if (parsedUrl.host == null && baseUrlStr) {
-		let parsedBaseUrl = URL.parse(baseUrlStr, true, true);
-		delete parsedUrl.hash;
-		ret.baseurl = URL.format(parsedBaseUrl);
-
-		let absoluteUrl = URL.parse(URL.resolve(parsedBaseUrl, parsedUrl));
-		currentUrlStr = URL.format(absoluteUrl);
-	}
+	if (parsedUrl.host == null && baseUrlStr) {}
 
 	parsedUrl = URL.parse(currentUrlStr, true, true);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] BooleanLiteral
crawler-url-parser.js:63:39
 		currentUrlStr = URL.format(absoluteUrl);
 	}
 
-	parsedUrl = URL.parse(currentUrlStr, true, true);
+	parsedUrl = URL.parse(currentUrlStr, false, true);
 	delete parsedUrl.hash;
 

[Killed] BlockStatement
crawler-url-parser.js:71:16
 	ret.host = parsedUrl.host;
 	ret.path = parsedUrl.pathname;
 
-	if (ret.host) {
-		let parsedHost = psl.parse(ret.host);
-		ret.domain = parsedHost.domain;
-		ret.subdomain = parsedHost.subdomain;
-	}
+	if (ret.host) {}
 
 	ret.search = parsedUrl.search;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:71:6
 	ret.host = parsedUrl.host;
 	ret.path = parsedUrl.pathname;
 
-	if (ret.host) {
+	if (false) {
 		let parsedHost = psl.parse(ret.host);
 		ret.domain = parsedHost.domain;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ArithmeticOperator
crawler-url-parser.js:78:38
 	}
 
 	ret.search = parsedUrl.search;
-	ret.querycount = parsedUrl.search ? parsedUrl.search.split("=").length - 1 : 0;
+	ret.querycount = parsedUrl.search ? parsedUrl.search.split("=").length + 1 : 0;
 
 	return ret;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:87:10
 	let urlMap = new Map();
 	var baseUrl = parse(sourceUrl);
 
-	let $ = typeof data === "string" ? cheerio.load(data) : data;
+	let $ = false ? cheerio.load(data) : data;
 	let embedBaseUrlStr = $('base').attr('href');
 	let embedBaseUrl = parse(embedBaseUrlStr);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] EqualityOperator
crawler-url-parser.js:87:10
 	let urlMap = new Map();
 	var baseUrl = parse(sourceUrl);
 
-	let $ = typeof data === "string" ? cheerio.load(data) : data;
+	let $ = typeof data !== "string" ? cheerio.load(data) : data;
 	let embedBaseUrlStr = $('base').attr('href');
 	let embedBaseUrl = parse(embedBaseUrlStr);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:93:31
 	baseUrl = embedBaseUrl ? embedBaseUrl : baseUrl;
 	let baseUrlStr = baseUrl ? baseUrl.url : null;
 
-	$('a').each(function (i, el) {
-		let href = $(this).attr('href');
-		let text = $(this).text().trim();
-		//href = href.replace(/;.*$/g,"");
-		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
-
-		let currentUrl = parse(href, baseUrlStr);
-
-		if (currentUrl && currentUrl.url) {
-			if (urlMap.has(currentUrl.url)) {
-				let tmpUrl = urlMap.get(currentUrl.url);
-				if (!tmpUrl.text.includes(text)) {
-					tmpUrl.text = `${tmpUrl.text} ${text}`;
-				}
-			} else {
-				currentUrl.text = text == null ? "" : text;
-				currentUrl.baseurl = baseUrlStr;
-				urlMap.set(currentUrl.url, currentUrl);
-			}
-		}
-	});
+	$('a').each(function (i, el) {});
 
 	//remove base url
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] MethodExpression
crawler-url-parser.js:95:14
 
 	$('a').each(function (i, el) {
 		let href = $(this).attr('href');
-		let text = $(this).text().trim();
+		let text = $(this).text();
 		//href = href.replace(/;.*$/g,"");
 		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;

[Killed] EqualityOperator
crawler-url-parser.js:97:37
 		let href = $(this).attr('href');
 		let text = $(this).text().trim();
 		//href = href.replace(/;.*$/g,"");
-		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+		if (typeof href == "undefined" || href.length >= 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
 
 		let currentUrl = parse(href, baseUrlStr);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] EqualityOperator
crawler-url-parser.js:97:7
 		let href = $(this).attr('href');
 		let text = $(this).text().trim();
 		//href = href.replace(/;.*$/g,"");
-		if (typeof href == "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
+		if (typeof href != "undefined" || href.length < 3 || /^(javascript|mailto:|ftp:)/ig.test(href)) return;
 
 		let currentUrl = parse(href, baseUrlStr);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:101:37
 
 		let currentUrl = parse(href, baseUrlStr);
 
-		if (currentUrl && currentUrl.url) {
-			if (urlMap.has(currentUrl.url)) {
-				let tmpUrl = urlMap.get(currentUrl.url);
-				if (!tmpUrl.text.includes(text)) {
-					tmpUrl.text = `${tmpUrl.text} ${text}`;
-				}
-			} else {
-				currentUrl.text = text == null ? "" : text;
-				currentUrl.baseurl = baseUrlStr;
-				urlMap.set(currentUrl.url, currentUrl);
-			}
-		}
+		if (currentUrl && currentUrl.url) {}
 	});
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:101:7
 
 		let currentUrl = parse(href, baseUrlStr);
 
-		if (currentUrl && currentUrl.url) {
+		if (false) {
 			if (urlMap.has(currentUrl.url)) {
 				let tmpUrl = urlMap.get(currentUrl.url);
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:102:8
 		let currentUrl = parse(href, baseUrlStr);
 
 		if (currentUrl && currentUrl.url) {
-			if (urlMap.has(currentUrl.url)) {
+			if (true) {
 				let tmpUrl = urlMap.get(currentUrl.url);
 				if (!tmpUrl.text.includes(text)) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] BlockStatement
crawler-url-parser.js:102:36
 		let currentUrl = parse(href, baseUrlStr);
 
 		if (currentUrl && currentUrl.url) {
-			if (urlMap.has(currentUrl.url)) {
-				let tmpUrl = urlMap.get(currentUrl.url);
-				if (!tmpUrl.text.includes(text)) {
-					tmpUrl.text = `${tmpUrl.text} ${text}`;
-				}
-			} else {
+			if (urlMap.has(currentUrl.url)) {} else {
 				currentUrl.text = text == null ? "" : text;
 				currentUrl.baseurl = baseUrlStr;

[Survived] ConditionalExpression
crawler-url-parser.js:104:9
 		if (currentUrl && currentUrl.url) {
 			if (urlMap.has(currentUrl.url)) {
 				let tmpUrl = urlMap.get(currentUrl.url);
-				if (!tmpUrl.text.includes(text)) {
+				if (true) {
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
 				}

[Survived] ConditionalExpression
crawler-url-parser.js:104:9
 		if (currentUrl && currentUrl.url) {
 			if (urlMap.has(currentUrl.url)) {
 				let tmpUrl = urlMap.get(currentUrl.url);
-				if (!tmpUrl.text.includes(text)) {
+				if (false) {
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
 				}

[Killed] BlockStatement
crawler-url-parser.js:107:11
 				if (!tmpUrl.text.includes(text)) {
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
 				}
-			} else {
-				currentUrl.text = text == null ? "" : text;
-				currentUrl.baseurl = baseUrlStr;
-				urlMap.set(currentUrl.url, currentUrl);
-			}
+			} else {}
 		}
 	});
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] ConditionalExpression
crawler-url-parser.js:108:23
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
 				}
 			} else {
-				currentUrl.text = text == null ? "" : text;
+				currentUrl.text = true ? "" : text;
 				currentUrl.baseurl = baseUrlStr;
 				urlMap.set(currentUrl.url, currentUrl);

[Survived] ConditionalExpression
crawler-url-parser.js:108:23
 					tmpUrl.text = `${tmpUrl.text} ${text}`;
 				}
 			} else {
-				currentUrl.text = text == null ? "" : text;
+				currentUrl.text = false ? "" : text;
 				currentUrl.baseurl = baseUrlStr;
 				urlMap.set(currentUrl.url, currentUrl);

[Killed] BlockStatement
crawler-url-parser.js:118:42
 	//remove base url
 	urlMap.delete(baseUrlStr);
 
-	for (let currentUrl of urlMap.values()) {
-		currentUrl.type = gettype(currentUrl, baseUrl);
-	}
+	for (let currentUrl of urlMap.values()) {}
 
 	let retArr = Array.from(urlMap.values());
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:124:36
 
 	let retArr = Array.from(urlMap.values());
 
-	retArr = retArr.map(function (el) {
-		return {
-			url: el.url,
-			text: el.text,
-			type: el.type
-		}
-	});
+	retArr = retArr.map(function (el) {});
 
 	return retArr;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:138:6
 
 function gettype(linkurl, pageurl) {
 
-	if (typeof linkurl == "string") linkurl = parse(linkurl);
+	if (true) linkurl = parse(linkurl);
 	if (typeof pageurl == "string") pageurl = parse(pageurl);
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] EqualityOperator
crawler-url-parser.js:138:6
 
 function gettype(linkurl, pageurl) {
 
-	if (typeof linkurl == "string") linkurl = parse(linkurl);
+	if (typeof linkurl != "string") linkurl = parse(linkurl);
 	if (typeof pageurl == "string") pageurl = parse(pageurl);
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:139:6
 function gettype(linkurl, pageurl) {
 
 	if (typeof linkurl == "string") linkurl = parse(linkurl);
-	if (typeof pageurl == "string") pageurl = parse(pageurl);
+	if (false) pageurl = parse(pageurl);
 
 	let linkurl_subdomain_len = linkurl.subdomain ? linkurl.subdomain.length : 0;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] EqualityOperator
crawler-url-parser.js:139:6
 function gettype(linkurl, pageurl) {
 
 	if (typeof linkurl == "string") linkurl = parse(linkurl);
-	if (typeof pageurl == "string") pageurl = parse(pageurl);
+	if (typeof pageurl != "string") pageurl = parse(pageurl);
 
 	let linkurl_subdomain_len = linkurl.subdomain ? linkurl.subdomain.length : 0;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] StringLiteral
crawler-url-parser.js:144:51
 	let linkurl_subdomain_len = linkurl.subdomain ? linkurl.subdomain.length : 0;
 	let pageurl_subdomain_len = pageurl.subdomain ? pageurl.subdomain.length : 0;
 
-	let linkurl_path = linkurl.path ? linkurl.path : "";
+	let linkurl_path = linkurl.path ? linkurl.path : "Stryker was here!";
 	let pageurl_path = pageurl.path ? pageurl.path : "";
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');

[Survived] StringLiteral
crawler-url-parser.js:145:51
 	let pageurl_subdomain_len = pageurl.subdomain ? pageurl.subdomain.length : 0;
 
 	let linkurl_path = linkurl.path ? linkurl.path : "";
-	let pageurl_path = pageurl.path ? pageurl.path : "";
+	let pageurl_path = pageurl.path ? pageurl.path : "Stryker was here!";
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');

[Survived] Regex
crawler-url-parser.js:146:38
 
 	let linkurl_path = linkurl.path ? linkurl.path : "";
 	let pageurl_path = pageurl.path ? pageurl.path : "";
-	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+/, '/').replace(/\/default\.[a-z]+$/, '/');
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 

[Survived] Regex
crawler-url-parser.js:147:38
 	let linkurl_path = linkurl.path ? linkurl.path : "";
 	let pageurl_path = pageurl.path ? pageurl.path : "";
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
-	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+	pageurl_path = pageurl_path.replace(/\/index\.[^a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {

[Survived] StringLiteral
crawler-url-parser.js:147:93
 	let linkurl_path = linkurl.path ? linkurl.path : "";
 	let pageurl_path = pageurl.path ? pageurl.path : "";
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
-	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
+	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, "");
 
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {

[Killed] MethodExpression
crawler-url-parser.js:149:22
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
-	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
-		return elem.length > 0
-	});
+	let linkurl_parts = linkurl_path.split("/");
 	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
 		return elem.length > 0
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:149:83
 	linkurl_path = linkurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
-	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
-		return elem.length > 0
-	});
+	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {});
 	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
 		return elem.length > 0
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] EqualityOperator
crawler-url-parser.js:150:10
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
-		return elem.length > 0
+		return elem.length >= 0
 	});
 	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:150:10
 	pageurl_path = pageurl_path.replace(/\/index\.[a-z]+$/, '/').replace(/\/default\.[a-z]+$/, '/');
 
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
-		return elem.length > 0
+		return true
 	});
 	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:152:83
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
 		return elem.length > 0
 	});
-	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
-		return elem.length > 0
-	});
+	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {});
 
 	if (pageurl.host == linkurl.host) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] MethodExpression
crawler-url-parser.js:152:22
 	let linkurl_parts = linkurl_path.split("/").filter(function (elem, index, array) {
 		return elem.length > 0
 	});
-	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
-		return elem.length > 0
-	});
+	let pageurl_parts = pageurl_path.split("/");
 
 	if (pageurl.host == linkurl.host) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:153:10
 		return elem.length > 0
 	});
 	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
-		return elem.length > 0
+		return true
 	});
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:153:10
 		return elem.length > 0
 	});
 	let pageurl_parts = pageurl_path.split("/").filter(function (elem, index, array) {
-		return elem.length > 0
+		return false
 	});
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert
