[Killed] BlockStatement
crawler-url-parser.js:156:36
 		return elem.length > 0
 	});
 
-	if (pageurl.host == linkurl.host) {
-
-		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
-
-		if (part_count_diff == 0) {
-			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
-		} else if (part_count_diff == 1) {
-			if (linkurl_path.includes(pageurl_path)) return "sublevel";
-		} else if (part_count_diff == -1) {
-			if (pageurl_path.includes(linkurl_path)) return "uplevel";
-		}
-
-		return "internal";
-	} else if (linkurl.domain == pageurl.domain) {
+	if (pageurl.host == linkurl.host) {} else if (linkurl.domain == pageurl.domain) {
 		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
 		return "subdomain";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:156:6
 		return elem.length > 0
 	});
 
-	if (pageurl.host == linkurl.host) {
+	if (true) {
 
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ArithmeticOperator
crawler-url-parser.js:158:25
 
 	if (pageurl.host == linkurl.host) {
 
-		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
+		let part_count_diff = linkurl_parts.length + pageurl_parts.length;
 
 		if (part_count_diff == 0) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:160:7
 
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
 
-		if (part_count_diff == 0) {
+		if (true) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] Regex
crawler-url-parser.js:161:57
 		let part_count_diff = linkurl_parts.length - pageurl_parts.length;
 
 		if (part_count_diff == 0) {
-			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[^\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"

[Killed] Regex
crawler-url-parser.js:162:57
 
 		if (part_count_diff == 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+			let pageurl_without_last_part = pageurl_path.replace(/(\/[\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] Regex
crawler-url-parser.js:162:57
 
 		if (part_count_diff == 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
+			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[^\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {

[Killed] ConditionalExpression
crawler-url-parser.js:163:8
 		if (part_count_diff == 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
+			if (false) return "samelevel"
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] EqualityOperator
crawler-url-parser.js:163:8
 		if (part_count_diff == 0) {
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
-			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
+			if (linkurl_without_last_part != pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:164:36
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
-		} else if (part_count_diff == 1) {
-			if (linkurl_path.includes(pageurl_path)) return "sublevel";
-		} else if (part_count_diff == -1) {
+		} else if (part_count_diff == 1) {} else if (part_count_diff == -1) {
 			if (pageurl_path.includes(linkurl_path)) return "uplevel";
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:164:14
 			let linkurl_without_last_part = linkurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
-		} else if (part_count_diff == 1) {
+		} else if (true) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
 		} else if (part_count_diff == -1) {
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:165:8
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
-			if (linkurl_path.includes(pageurl_path)) return "sublevel";
+			if (true) return "sublevel";
 		} else if (part_count_diff == -1) {
 			if (pageurl_path.includes(linkurl_path)) return "uplevel";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:165:8
 			let pageurl_without_last_part = pageurl_path.replace(/(\/[^\/]*)[\/]?$/, "");
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
-			if (linkurl_path.includes(pageurl_path)) return "sublevel";
+			if (false) return "sublevel";
 		} else if (part_count_diff == -1) {
 			if (pageurl_path.includes(linkurl_path)) return "uplevel";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] BlockStatement
crawler-url-parser.js:166:37
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
-		} else if (part_count_diff == -1) {
-			if (pageurl_path.includes(linkurl_path)) return "uplevel";
-		}
+		} else if (part_count_diff == -1) {}
 
 		return "internal";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:166:14
 			if (linkurl_without_last_part == pageurl_without_last_part) return "samelevel"
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
-		} else if (part_count_diff == -1) {
+		} else if (false) {
 			if (pageurl_path.includes(linkurl_path)) return "uplevel";
 		}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:167:8
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
 		} else if (part_count_diff == -1) {
-			if (pageurl_path.includes(linkurl_path)) return "uplevel";
+			if (true) return "uplevel";
 		}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:167:8
 		} else if (part_count_diff == 1) {
 			if (linkurl_path.includes(pageurl_path)) return "sublevel";
 		} else if (part_count_diff == -1) {
-			if (pageurl_path.includes(linkurl_path)) return "uplevel";
+			if (false) return "uplevel";
 		}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:171:13
 		}
 
 		return "internal";
-	} else if (linkurl.domain == pageurl.domain) {
+	} else if (true) {
 		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
 		return "subdomain";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:171:13
 		}
 
 		return "internal";
-	} else if (linkurl.domain == pageurl.domain) {
+	} else if (false) {
 		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
 		return "subdomain";
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] EqualityOperator
crawler-url-parser.js:172:7
 
 		return "internal";
 	} else if (linkurl.domain == pageurl.domain) {
-		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
+		if (linkurl_subdomain_len >= pageurl_subdomain_len) return "updomain";
 		return "subdomain";
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] ConditionalExpression
crawler-url-parser.js:172:7
 
 		return "internal";
 	} else if (linkurl.domain == pageurl.domain) {
-		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
+		if (false) return "updomain";
 		return "subdomain";
 	}
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Killed] StringLiteral
crawler-url-parser.js:173:10
 		return "internal";
 	} else if (linkurl.domain == pageurl.domain) {
 		if (linkurl_subdomain_len < pageurl_subdomain_len) return "updomain";
-		return "subdomain";
+		return "";
 	}
 
killedBy: All tests
statusReason: > crawler-url-parser@2.0.5 test
> mocha --recursive --grep crawler test 06 --invert

[Survived] ConditionalExpression
crawler-url-parser.js:185:5
 
 
 //for testing purpose
-if (!module.parent) {
+if (true) {
 	console.log("for testing purpose");
 	//getlevel("www.domain.com/aaa/bbb/","www.domain.com/aaa/bbb/ccc");

[Survived] StringLiteral
crawler-url-parser.js:186:14
 
 //for testing purpose
 if (!module.parent) {
-	console.log("for testing purpose");
+	console.log("");
 	//getlevel("www.domain.com/aaa/bbb/","www.domain.com/aaa/bbb/ccc");
 	//let res1 = getlevel("sub.domain.com/aaa/bbb/","sub.domain.com/aaa/bbb/ccc");

[Survived] StringLiteral
crawler-url-parser.js:204:12
 	//process.exit();
 
 
-	let url = "https ://www.npmjs.com/package/electron-window-manager";
+	let url = "";
 	let res = parse(url);
 	debugger;
