[Killed] BlockStatement
lib/dirty/dirty.js:7:21
 const EventEmitter = require('events').EventEmitter;
 
 class Dirty extends EventEmitter {
-  constructor(path) {
-    super();
-
-    this.path = path;
-
-    this._data = new Map();
-    this._queue = new Map(); // Maps key to a list of callbacks.
-    this._readStream = null;
-    this._writeStream = null;
-    this._waitForDrain = false;
-    this._inFlightWrites = 0;
-
-    this._load();
-  }
+  constructor(path) {}
 
   /**
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list



ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BooleanLiteral
lib/dirty/dirty.js:16:26
     this._queue = new Map(); // Maps key to a list of callbacks.
     this._readStream = null;
     this._writeStream = null;
-    this._waitForDrain = false;
+    this._waitForDrain = true;
     this._inFlightWrites = 0;
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:27:21
    * cb is fired when the data is persisted.
    * In memory, this is immediate - on disk, it will take some time.
    */
-  set(key, val, cb) {
-    if (val === undefined) {
-      this._data.delete(key);
-    } else {
-      this._data.set(key, val);
-    }
-    if (this.path) {
-      const cbs = this._queue.get(key) || [];
-      if (cb) cbs.push(cb);
-      this._queue.set(key, cbs);
-      this._flush();
-    } else {
-      setImmediate(() => { if (cb) cb(); this.emit('drain'); });
-    }
-  }
+  set(key, val, cb) {}
 
   /**
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:28:9
    * In memory, this is immediate - on disk, it will take some time.
    */
   set(key, val, cb) {
-    if (val === undefined) {
+    if (true) {
       this._data.delete(key);
     } else {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:28:9
    * In memory, this is immediate - on disk, it will take some time.
    */
   set(key, val, cb) {
-    if (val === undefined) {
+    if (false) {
       this._data.delete(key);
     } else {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:30:12
   set(key, val, cb) {
     if (val === undefined) {
       this._data.delete(key);
-    } else {
-      this._data.set(key, val);
-    }
+    } else {}
     if (this.path) {
       const cbs = this._queue.get(key) || [];
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:33:9
     } else {
       this._data.set(key, val);
     }
-    if (this.path) {
+    if (true) {
       const cbs = this._queue.get(key) || [];
       if (cb) cbs.push(cb);
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list



TypeError: Cannot read properties of null (reading 'cork')

[Killed] BlockStatement
lib/dirty/dirty.js:33:20
     } else {
       this._data.set(key, val);
     }
-    if (this.path) {
-      const cbs = this._queue.get(key) || [];
-      if (cb) cbs.push(cb);
-      this._queue.set(key, cbs);
-      this._flush();
-    } else {
+    if (this.path) {} else {
       setImmediate(() => { if (cb) cb(); this.emit('drain'); });
     }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:34:19
       this._data.set(key, val);
     }
     if (this.path) {
-      const cbs = this._queue.get(key) || [];
+      const cbs = true;
       if (cb) cbs.push(cb);
       this._queue.set(key, cbs);
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] LogicalOperator
lib/dirty/dirty.js:34:19
       this._data.set(key, val);
     }
     if (this.path) {
-      const cbs = this._queue.get(key) || [];
+      const cbs = this._queue.get(key) && [];
       if (cb) cbs.push(cb);
       this._queue.set(key, cbs);
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:35:11
     }
     if (this.path) {
       const cbs = this._queue.get(key) || [];
-      if (cb) cbs.push(cb);
+      if (true) cbs.push(cb);
       this._queue.set(key, cbs);
       this._flush();
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:35:11
     }
     if (this.path) {
       const cbs = this._queue.get(key) || [];
-      if (cb) cbs.push(cb);
+      if (false) cbs.push(cb);
       this._queue.set(key, cbs);
       this._flush();
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:38:12
       if (cb) cbs.push(cb);
       this._queue.set(key, cbs);
       this._flush();
-    } else {
-      setImmediate(() => { if (cb) cb(); this.emit('drain'); });
-    }
+    } else {}
   }
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:39:26
       this._queue.set(key, cbs);
       this._flush();
     } else {
-      setImmediate(() => { if (cb) cb(); this.emit('drain'); });
+      setImmediate(() => {});
     }
   }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:39:32
       this._queue.set(key, cbs);
       this._flush();
     } else {
-      setImmediate(() => { if (cb) cb(); this.emit('drain'); });
+      setImmediate(() => { if (false) cb(); this.emit('drain'); });
     }
   }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:47:12
    * Get the value stored at a key in the database
    * This is synchronous since a cache is maintained in-memory
    */
-  get(key) {
-    return this._data.get(key);
-  }
+  get(key) {}
 
   /**
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:54:10
   /**
    * Get total number of stored keys
    */
-  size() {
-    return this._data.size;
-  }
+  size() {}
 
   /**
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:61:15
   /**
    * Remove a key and the value stored there
    */
-  rm(key, cb) {
-    this.set(key, undefined, cb);
-  }
+  rm(key, cb) {}
 
   /**
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:68:15
   /**
    * Iterate over keys, applying match function
    */
-  forEach(fn) {
-    for (const [key, val] of this._data) {
-      if (fn(key, val) === false) break;
-    }
-  }
+  forEach(fn) {}
 
   /**
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:69:42
    * Iterate over keys, applying match function
    */
   forEach(fn) {
-    for (const [key, val] of this._data) {
-      if (fn(key, val) === false) break;
-    }
+    for (const [key, val] of this._data) {}
   }
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:70:11
    */
   forEach(fn) {
     for (const [key, val] of this._data) {
-      if (fn(key, val) === false) break;
+      if (true) break;
     }
   }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] EqualityOperator
lib/dirty/dirty.js:70:11
    */
   forEach(fn) {
     for (const [key, val] of this._data) {
-      if (fn(key, val) === false) break;
+      if (fn(key, val) !== false) break;
     }
   }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:79:28
    * This is synchronous since a cache is maintained in-memory
    * cb is passed as per Dirty.prototype.set
    */
-  update(key, updater, cb) {
-    this.set(key, updater(this.get(key)), cb);
-  }
+  update(key, updater, cb) {}
 
   /**
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:86:11
   /**
    * Close dirty db file streams
    */
-  close() {
-    if (this._queue.size || this._inFlightWrites > 0) {
-      this.once('drain', () => this.close());
-      return;
-    }
-    if (this._readStream) this._readStream.destroy();
-    if (this._writeStream) this._writeStream.end(() => this._writeStream.destroy());
-  }
+  close() {}
 
   // Called when a dirty connection is instantiated
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] EqualityOperator
lib/dirty/dirty.js:87:29
    * Close dirty db file streams
    */
   close() {
-    if (this._queue.size || this._inFlightWrites > 0) {
+    if (this._queue.size || this._inFlightWrites >= 0) {
       this.once('drain', () => this.close());
       return;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] EqualityOperator
lib/dirty/dirty.js:87:29
    * Close dirty db file streams
    */
   close() {
-    if (this._queue.size || this._inFlightWrites > 0) {
+    if (this._queue.size || this._inFlightWrites <= 0) {
       this.once('drain', () => this.close());
       return;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Survived] ArrowFunction
lib/dirty/dirty.js:88:26
    */
   close() {
     if (this._queue.size || this._inFlightWrites > 0) {
-      this.once('drain', () => this.close());
+      this.once('drain', () => undefined);
       return;
     }

[Killed] ConditionalExpression
lib/dirty/dirty.js:91:9
       this.once('drain', () => this.close());
       return;
     }
-    if (this._readStream) this._readStream.destroy();
+    if (true) this._readStream.destroy();
     if (this._writeStream) this._writeStream.end(() => this._writeStream.destroy());
   }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Survived] ConditionalExpression
lib/dirty/dirty.js:91:9
       this.once('drain', () => this.close());
       return;
     }
-    if (this._readStream) this._readStream.destroy();
+    if (false) this._readStream.destroy();
     if (this._writeStream) this._writeStream.end(() => this._writeStream.destroy());
   }

[Killed] ConditionalExpression
lib/dirty/dirty.js:92:9
       return;
     }
     if (this._readStream) this._readStream.destroy();
-    if (this._writeStream) this._writeStream.end(() => this._writeStream.destroy());
+    if (false) this._writeStream.end(() => this._writeStream.destroy());
   }
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Survived] ConditionalExpression
lib/dirty/dirty.js:92:9
       return;
     }
     if (this._readStream) this._readStream.destroy();
-    if (this._writeStream) this._writeStream.end(() => this._writeStream.destroy());
+    if (true) this._writeStream.end(() => this._writeStream.destroy());
   }
 

[Killed] BlockStatement
lib/dirty/dirty.js:99:21
   _load() {
     let buffer = '';
 
-    if (!this.path) {
-      process.nextTick(() => {
-        this.emit('load', 0);
-      });
-      return;
-    }
+    if (!this.path) {}
 
     this._readStream = fs.createReadStream(this.path, {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list



TypeError [ERR_INVALID_ARG_TYPE]: The "path" argument must be of type string or an instance of Buffer or URL. Received undefined

[Killed] ConditionalExpression
lib/dirty/dirty.js:99:9
   _load() {
     let buffer = '';
 
-    if (!this.path) {
+    if (true) {
       process.nextTick(() => {
         this.emit('load', 0);
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:100:30
     let buffer = '';
 
     if (!this.path) {
-      process.nextTick(() => {
-        this.emit('load', 0);
-      });
+      process.nextTick(() => {});
       return;
     }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Survived] ObjectLiteral
lib/dirty/dirty.js:106:55
       return;
     }
 
-    this._readStream = fs.createReadStream(this.path, {
-      encoding: 'utf-8',
-      flags: 'r',
-    });
+    this._readStream = fs.createReadStream(this.path, {});
 
     this._readStream

[Survived] StringLiteral
lib/dirty/dirty.js:107:17
     }
 
     this._readStream = fs.createReadStream(this.path, {
-      encoding: 'utf-8',
+      encoding: "",
       flags: 'r',
     });

[Killed] StringLiteral
lib/dirty/dirty.js:108:14
 
     this._readStream = fs.createReadStream(this.path, {
       encoding: 'utf-8',
-      flags: 'r',
+      flags: "",
     });
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list


node:events:502
      throw er; // Unhandled 'error' event
      ^

[Killed] BlockStatement
lib/dirty/dirty.js:112:31
     });
 
     this._readStream
-        .on('error', (err) => {
-          if (err.code === 'ENOENT') {
-            this.emit('load', 0);
-            return;
-          }
-
-          this.emit('error', err);
-        })
+        .on('error', (err) => {})
         .on('data', (chunk) => {
           buffer += chunk;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:113:15
 
     this._readStream
         .on('error', (err) => {
-          if (err.code === 'ENOENT') {
+          if (false) {
             this.emit('load', 0);
             return;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list


node:events:502
      throw er; // Unhandled 'error' event
      ^

[Killed] EqualityOperator
lib/dirty/dirty.js:113:15
 
     this._readStream
         .on('error', (err) => {
-          if (err.code === 'ENOENT') {
+          if (err.code !== 'ENOENT') {
             this.emit('load', 0);
             return;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list


node:events:502
      throw er; // Unhandled 'error' event
      ^

[Killed] StringLiteral
lib/dirty/dirty.js:120:13
 
           this.emit('error', err);
         })
-        .on('data', (chunk) => {
+        .on("", (chunk) => {
           buffer += chunk;
           if (chunk.lastIndexOf('\n') === -1) return;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] AssignmentOperator
lib/dirty/dirty.js:121:11
           this.emit('error', err);
         })
         .on('data', (chunk) => {
-          buffer += chunk;
+          buffer -= chunk;
           if (chunk.lastIndexOf('\n') === -1) return;
           const arr = buffer.split('\n');
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:122:15
         })
         .on('data', (chunk) => {
           buffer += chunk;
-          if (chunk.lastIndexOf('\n') === -1) return;
+          if (true) return;
           const arr = buffer.split('\n');
           buffer = arr.pop();
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] EqualityOperator
lib/dirty/dirty.js:122:15
         })
         .on('data', (chunk) => {
           buffer += chunk;
-          if (chunk.lastIndexOf('\n') === -1) return;
+          if (chunk.lastIndexOf('\n') !== -1) return;
           const arr = buffer.split('\n');
           buffer = arr.pop();
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] StringLiteral
lib/dirty/dirty.js:123:36
         .on('data', (chunk) => {
           buffer += chunk;
           if (chunk.lastIndexOf('\n') === -1) return;
-          const arr = buffer.split('\n');
+          const arr = buffer.split("");
           buffer = arr.pop();
           arr.forEach((rowStr) => {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:125:35
           if (chunk.lastIndexOf('\n') === -1) return;
           const arr = buffer.split('\n');
           buffer = arr.pop();
-          arr.forEach((rowStr) => {
-            if (!rowStr) {
-              this.emit('error', new Error('Empty lines never appear in a healthy database'));
-              return;
-            }
-
-            let row;
-            try {
-              row = JSON.parse(rowStr);
-              if (!('key' in row)) {
-                throw new Error();
-              }
-            } catch (e) {
-              this.emit('error', new Error(`Could not load corrupted row: ${rowStr}`));
-              return '';
-            }
-
-            if (row.val === undefined) {
-              this._data.delete(row.key);
-            } else {
-              this._data.set(row.key, row.val);
-            }
-            return '';
-          });
+          arr.forEach((rowStr) => {});
         })
         .on('end', () => {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:126:17
           const arr = buffer.split('\n');
           buffer = arr.pop();
           arr.forEach((rowStr) => {
-            if (!rowStr) {
+            if (true) {
               this.emit('error', new Error('Empty lines never appear in a healthy database'));
               return;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BooleanLiteral
lib/dirty/dirty.js:126:17
           const arr = buffer.split('\n');
           buffer = arr.pop();
           arr.forEach((rowStr) => {
-            if (!rowStr) {
+            if (rowStr) {
               this.emit('error', new Error('Empty lines never appear in a healthy database'));
               return;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:132:17
             }
 
             let row;
-            try {
-              row = JSON.parse(rowStr);
-              if (!('key' in row)) {
-                throw new Error();
-              }
-            } catch (e) {
+            try {} catch (e) {
               this.emit('error', new Error(`Could not load corrupted row: ${rowStr}`));
               return '';
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:134:19
             let row;
             try {
               row = JSON.parse(rowStr);
-              if (!('key' in row)) {
+              if (true) {
                 throw new Error();
               }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BooleanLiteral
lib/dirty/dirty.js:134:19
             let row;
             try {
               row = JSON.parse(rowStr);
-              if (!('key' in row)) {
+              if ('key' in row) {
                 throw new Error();
               }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Survived] BlockStatement
lib/dirty/dirty.js:137:25
               if (!('key' in row)) {
                 throw new Error();
               }
-            } catch (e) {
-              this.emit('error', new Error(`Could not load corrupted row: ${rowStr}`));
-              return '';
-            }
+            } catch (e) {}
 
             if (row.val === undefined) {

[Survived] StringLiteral
lib/dirty/dirty.js:138:25
                 throw new Error();
               }
             } catch (e) {
-              this.emit('error', new Error(`Could not load corrupted row: ${rowStr}`));
+              this.emit("", new Error(`Could not load corrupted row: ${rowStr}`));
               return '';
             }

[Survived] StringLiteral
lib/dirty/dirty.js:138:44
                 throw new Error();
               }
             } catch (e) {
-              this.emit('error', new Error(`Could not load corrupted row: ${rowStr}`));
+              this.emit('error', new Error(``));
               return '';
             }

[Killed] EqualityOperator
lib/dirty/dirty.js:142:17
               return '';
             }
 
-            if (row.val === undefined) {
+            if (row.val !== undefined) {
               this._data.delete(row.key);
             } else {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:142:40
               return '';
             }
 
-            if (row.val === undefined) {
-              this._data.delete(row.key);
-            } else {
+            if (row.val === undefined) {} else {
               this._data.set(row.key, row.val);
             }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:144:20
 
             if (row.val === undefined) {
               this._data.delete(row.key);
-            } else {
-              this._data.set(row.key, row.val);
-            }
+            } else {}
             return '';
           });
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:150:26
             return '';
           });
         })
-        .on('end', () => {
-          if (buffer.length) {
-            this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
-          }
-          this.emit('load', this._data.size);
-        })
+        .on('end', () => {})
         .on('close', () => {
           this._readStream = null;
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:151:15
           });
         })
         .on('end', () => {
-          if (buffer.length) {
+          if (true) {
             this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
           }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Survived] ConditionalExpression
lib/dirty/dirty.js:151:15
           });
         })
         .on('end', () => {
-          if (buffer.length) {
+          if (false) {
             this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
           }

[Killed] StringLiteral
lib/dirty/dirty.js:154:21
           if (buffer.length) {
             this.emit('error', new Error(`Corrupted row at the end of the db: ${buffer}`));
           }
-          this.emit('load', this._data.size);
+          this.emit("", this._data.size);
         })
         .on('close', () => {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Survived] BlockStatement
lib/dirty/dirty.js:156:28
           }
           this.emit('load', this._data.size);
         })
-        .on('close', () => {
-          this._readStream = null;
-          this.emit('read_close');
-        });
+        .on('close', () => {});
 
     this._writeStream = fs.createWriteStream(this.path, {

[Survived] StringLiteral
lib/dirty/dirty.js:162:17
         });
 
     this._writeStream = fs.createWriteStream(this.path, {
-      encoding: 'utf-8',
+      encoding: "",
       flags: 'a',
     });

[Killed] StringLiteral
lib/dirty/dirty.js:163:14
 
     this._writeStream = fs.createWriteStream(this.path, {
       encoding: 'utf-8',
-      flags: 'a',
+      flags: "",
     });
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list


node:events:502
      throw er; // Unhandled 'error' event
      ^

[Survived] BlockStatement
lib/dirty/dirty.js:166:41
       flags: 'a',
     });
 
-    this._writeStream.on('drain', () => {
-      this._waitForDrain = false;
-      if (!this._queue.size) {
-        if (this._inFlightWrites <= 0) this.emit('drain');
-      } else {
-        this._flush();
-      }
-    });
+    this._writeStream.on('drain', () => {});
 
     this._writeStream.on('close', () => {

[Survived] BooleanLiteral
lib/dirty/dirty.js:167:28
     });
 
     this._writeStream.on('drain', () => {
-      this._waitForDrain = false;
+      this._waitForDrain = true;
       if (!this._queue.size) {
         if (this._inFlightWrites <= 0) this.emit('drain');

[Survived] ConditionalExpression
lib/dirty/dirty.js:168:11
 
     this._writeStream.on('drain', () => {
       this._waitForDrain = false;
-      if (!this._queue.size) {
+      if (false) {
         if (this._inFlightWrites <= 0) this.emit('drain');
       } else {

[Survived] ConditionalExpression
lib/dirty/dirty.js:168:11
 
     this._writeStream.on('drain', () => {
       this._waitForDrain = false;
-      if (!this._queue.size) {
+      if (true) {
         if (this._inFlightWrites <= 0) this.emit('drain');
       } else {

[Survived] ConditionalExpression
lib/dirty/dirty.js:169:13
     this._writeStream.on('drain', () => {
       this._waitForDrain = false;
       if (!this._queue.size) {
-        if (this._inFlightWrites <= 0) this.emit('drain');
+        if (false) this.emit('drain');
       } else {
         this._flush();

[Survived] ConditionalExpression
lib/dirty/dirty.js:169:13
     this._writeStream.on('drain', () => {
       this._waitForDrain = false;
       if (!this._queue.size) {
-        if (this._inFlightWrites <= 0) this.emit('drain');
+        if (true) this.emit('drain');
       } else {
         this._flush();

[Survived] BlockStatement
lib/dirty/dirty.js:170:14
       this._waitForDrain = false;
       if (!this._queue.size) {
         if (this._inFlightWrites <= 0) this.emit('drain');
-      } else {
-        this._flush();
-      }
+      } else {}
     });
 

[Killed] BlockStatement
lib/dirty/dirty.js:175:41
       }
     });
 
-    this._writeStream.on('close', () => {
-      this._writeStream = null;
-      this.emit('write_close');
-    });
+    this._writeStream.on('close', () => {});
   }
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:
