[Killed] BlockStatement
lib/dirty/dirty.js:181:12
     });
   }
 
-  _flush() {
-    if (!this._queue.size || this._waitForDrain) return;
-    this._writeStream.cork();
-    for (const [key, cbs] of this._queue) {
-      this._queue.delete(key);
-      const data = `${JSON.stringify({key, val: this._data.get(key)})}\n`;
-      ++this._inFlightWrites;
-      this._waitForDrain = !this._writeStream.write(data, (err) => {
-        if (!cbs.length && err != null) this.emit('error', err);
-        if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
-        for (const cb of cbs) cb(err);
-      });
-      if (this._waitForDrain) break;
-    }
-    this._writeStream.uncork();
-  }
+  _flush() {}
 }
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:182:9
   }
 
   _flush() {
-    if (!this._queue.size || this._waitForDrain) return;
+    if (true) return;
     this._writeStream.cork();
     for (const [key, cbs] of this._queue) {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BooleanLiteral
lib/dirty/dirty.js:182:9
   }
 
   _flush() {
-    if (!this._queue.size || this._waitForDrain) return;
+    if (this._queue.size || this._waitForDrain) return;
     this._writeStream.cork();
     for (const [key, cbs] of this._queue) {
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:184:43
   _flush() {
     if (!this._queue.size || this._waitForDrain) return;
     this._writeStream.cork();
-    for (const [key, cbs] of this._queue) {
-      this._queue.delete(key);
-      const data = `${JSON.stringify({key, val: this._data.get(key)})}\n`;
-      ++this._inFlightWrites;
-      this._waitForDrain = !this._writeStream.write(data, (err) => {
-        if (!cbs.length && err != null) this.emit('error', err);
-        if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
-        for (const cb of cbs) cb(err);
-      });
-      if (this._waitForDrain) break;
-    }
+    for (const [key, cbs] of this._queue) {}
     this._writeStream.uncork();
   }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] UpdateOperator
lib/dirty/dirty.js:187:7
     for (const [key, cbs] of this._queue) {
       this._queue.delete(key);
       const data = `${JSON.stringify({key, val: this._data.get(key)})}\n`;
-      ++this._inFlightWrites;
+      --this._inFlightWrites;
       this._waitForDrain = !this._writeStream.write(data, (err) => {
         if (!cbs.length && err != null) this.emit('error', err);
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BooleanLiteral
lib/dirty/dirty.js:188:28
       this._queue.delete(key);
       const data = `${JSON.stringify({key, val: this._data.get(key)})}\n`;
       ++this._inFlightWrites;
-      this._waitForDrain = !this._writeStream.write(data, (err) => {
-        if (!cbs.length && err != null) this.emit('error', err);
-        if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
-        for (const cb of cbs) cb(err);
-      });
+      this._waitForDrain = this._writeStream.write(data, err => {
+  if (!cbs.length && err != null) this.emit('error', err);
+  if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
+  for (const cb of cbs) cb(err);
+});
       if (this._waitForDrain) break;
     }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] BlockStatement
lib/dirty/dirty.js:188:68
       this._queue.delete(key);
       const data = `${JSON.stringify({key, val: this._data.get(key)})}\n`;
       ++this._inFlightWrites;
-      this._waitForDrain = !this._writeStream.write(data, (err) => {
-        if (!cbs.length && err != null) this.emit('error', err);
-        if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
-        for (const cb of cbs) cb(err);
-      });
+      this._waitForDrain = !this._writeStream.write(data, (err) => {});
       if (this._waitForDrain) break;
     }
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] LogicalOperator
lib/dirty/dirty.js:189:13
       const data = `${JSON.stringify({key, val: this._data.get(key)})}\n`;
       ++this._inFlightWrites;
       this._waitForDrain = !this._writeStream.write(data, (err) => {
-        if (!cbs.length && err != null) this.emit('error', err);
+        if (!cbs.length || err != null) this.emit('error', err);
         if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
         for (const cb of cbs) cb(err);
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] EqualityOperator
lib/dirty/dirty.js:189:28
       const data = `${JSON.stringify({key, val: this._data.get(key)})}\n`;
       ++this._inFlightWrites;
       this._waitForDrain = !this._writeStream.write(data, (err) => {
-        if (!cbs.length && err != null) this.emit('error', err);
+        if (!cbs.length && err == null) this.emit('error', err);
         if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
         for (const cb of cbs) cb(err);
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:190:13
       ++this._inFlightWrites;
       this._waitForDrain = !this._writeStream.write(data, (err) => {
         if (!cbs.length && err != null) this.emit('error', err);
-        if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
+        if (true) this.emit('drain');
         for (const cb of cbs) cb(err);
       });
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Killed] ConditionalExpression
lib/dirty/dirty.js:190:13
       ++this._inFlightWrites;
       this._waitForDrain = !this._writeStream.write(data, (err) => {
         if (!cbs.length && err != null) this.emit('error', err);
-        if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
+        if (true && !this._waitForDrain) this.emit('drain');
         for (const cb of cbs) cb(err);
       });
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:

[Survived] ConditionalExpression
lib/dirty/dirty.js:193:11
         if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
         for (const cb of cbs) cb(err);
       });
-      if (this._waitForDrain) break;
+      if (false) break;
     }
     this._writeStream.uncork();

[Survived] ConditionalExpression
lib/dirty/dirty.js:193:11
         if (--this._inFlightWrites <= 0 && !this._waitForDrain) this.emit('drain');
         for (const cb of cbs) cb(err);
       });
-      if (this._waitForDrain) break;
+      if (true) break;
     }
     this._writeStream.uncork();

[Killed] ArrowFunction
lib/dirty/dirty.js:201:53
 
 Dirty.Dirty = Dirty;
 // Trap `apply` for backwards compatibility with callers that don't use `new`.
-module.exports = exports = new Proxy(Dirty, {apply: (target, thisArg, args) => new Dirty(...args)});
+module.exports = exports = new Proxy(Dirty, {apply: () => undefined});
 
killedBy: All tests
statusReason: > dirty@1.1.3 test
> mocha test/test-*.js -R list




    dirty api (transient mode) constructor without new:
