[Timeout] BlockStatement
index.js:2:5
 let _fs
-try {
-  _fs = require('graceful-fs')
-} catch (_) {
+try {} catch (_) {
   _fs = require('fs')
 }

[Survived] BlockStatement
index.js:4:13
 let _fs
 try {
   _fs = require('graceful-fs')
-} catch (_) {
-  _fs = require('fs')
-}
+} catch (_) {}
 const universalify = require('universalify')
 const { stringify, stripBom } = require('./utils')

[Killed] BlockStatement
index.js:11:36
 const { stringify, stripBom } = require('./utils')
 
 async function _readFile (file, options = {}) {
-  if (typeof options === 'string') {
-    options = { encoding: options }
-  }
+  if (typeof options === 'string') {}
 
   const fs = options.fs || _fs
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] EqualityOperator
index.js:11:7
 const { stringify, stripBom } = require('./utils')
 
 async function _readFile (file, options = {}) {
-  if (typeof options === 'string') {
+  if (typeof options !== 'string') {
     options = { encoding: options }
   }
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Survived] ObjectLiteral
index.js:12:15
 
 async function _readFile (file, options = {}) {
   if (typeof options === 'string') {
-    options = { encoding: options }
+    options = {}
   }
 

[Killed] LogicalOperator
index.js:15:14
     options = { encoding: options }
   }
 
-  const fs = options.fs || _fs
+  const fs = options.fs && _fs
 
   const shouldThrow = 'throws' in options ? options.throws : true
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
index.js:15:14
     options = { encoding: options }
   }
 
-  const fs = options.fs || _fs
+  const fs = false
 
   const shouldThrow = 'throws' in options ? options.throws : true
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BooleanLiteral
index.js:17:62
 
   const fs = options.fs || _fs
 
-  const shouldThrow = 'throws' in options ? options.throws : true
+  const shouldThrow = 'throws' in options ? options.throws : false
 
   let data = await universalify.fromCallback(fs.readFile)(file, options)
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:24:7
   data = stripBom(data)
 
   let obj
-  try {
-    obj = JSON.parse(data, options ? options.reviver : null)
-  } catch (err) {
+  try {} catch (err) {
     if (shouldThrow) {
       err.message = `${file}: ${err.message}`
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:26:17
   let obj
   try {
     obj = JSON.parse(data, options ? options.reviver : null)
-  } catch (err) {
-    if (shouldThrow) {
-      err.message = `${file}: ${err.message}`
-      throw err
-    } else {
-      return null
-    }
-  }
+  } catch (err) {}
 
   return obj
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
index.js:27:9
   try {
     obj = JSON.parse(data, options ? options.reviver : null)
   } catch (err) {
-    if (shouldThrow) {
+    if (false) {
       err.message = `${file}: ${err.message}`
       throw err
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
index.js:27:9
   try {
     obj = JSON.parse(data, options ? options.reviver : null)
   } catch (err) {
-    if (shouldThrow) {
+    if (true) {
       err.message = `${file}: ${err.message}`
       throw err
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:30:12
     if (shouldThrow) {
       err.message = `${file}: ${err.message}`
       throw err
-    } else {
-      return null
-    }
+    } else {}
   }
 
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:40:44
 
 const readFile = universalify.fromPromise(_readFile)
 
-function readFileSync (file, options = {}) {
-  if (typeof options === 'string') {
-    options = { encoding: options }
-  }
-
-  const fs = options.fs || _fs
-
-  const shouldThrow = 'throws' in options ? options.throws : true
-
-  try {
-    let content = fs.readFileSync(file, options)
-    content = stripBom(content)
-    return JSON.parse(content, options.reviver)
-  } catch (err) {
-    if (shouldThrow) {
-      err.message = `${file}: ${err.message}`
-      throw err
-    } else {
-      return null
-    }
-  }
-}
+function readFileSync (file, options = {}) {}
 
 async function _writeFile (file, obj, options = {}) {
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
index.js:41:7
 const readFile = universalify.fromPromise(_readFile)
 
 function readFileSync (file, options = {}) {
-  if (typeof options === 'string') {
+  if (true) {
     options = { encoding: options }
   }
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:41:36
 const readFile = universalify.fromPromise(_readFile)
 
 function readFileSync (file, options = {}) {
-  if (typeof options === 'string') {
-    options = { encoding: options }
-  }
+  if (typeof options === 'string') {}
 
   const fs = options.fs || _fs
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
index.js:45:14
     options = { encoding: options }
   }
 
-  const fs = options.fs || _fs
+  const fs = true
 
   const shouldThrow = 'throws' in options ? options.throws : true
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] StringLiteral
index.js:47:23
 
   const fs = options.fs || _fs
 
-  const shouldThrow = 'throws' in options ? options.throws : true
+  const shouldThrow = "" in options ? options.throws : true
 
   try {
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:49:7
 
   const shouldThrow = 'throws' in options ? options.throws : true
 
-  try {
-    let content = fs.readFileSync(file, options)
-    content = stripBom(content)
-    return JSON.parse(content, options.reviver)
-  } catch (err) {
+  try {} catch (err) {
     if (shouldThrow) {
       err.message = `${file}: ${err.message}`
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:53:17
     let content = fs.readFileSync(file, options)
     content = stripBom(content)
     return JSON.parse(content, options.reviver)
-  } catch (err) {
-    if (shouldThrow) {
-      err.message = `${file}: ${err.message}`
-      throw err
-    } else {
-      return null
-    }
-  }
+  } catch (err) {}
 }
 
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:54:22
     content = stripBom(content)
     return JSON.parse(content, options.reviver)
   } catch (err) {
-    if (shouldThrow) {
-      err.message = `${file}: ${err.message}`
-      throw err
-    } else {
+    if (shouldThrow) {} else {
       return null
     }
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:63:53
   }
 }
 
-async function _writeFile (file, obj, options = {}) {
-  const fs = options.fs || _fs
-
-  const str = stringify(obj, options)
-
-  await universalify.fromCallback(fs.writeFile)(file, str, options)
-}
+async function _writeFile (file, obj, options = {}) {}
 
 const writeFile = universalify.fromPromise(_writeFile)
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
index.js:64:14
 }
 
 async function _writeFile (file, obj, options = {}) {
-  const fs = options.fs || _fs
+  const fs = false
 
   const str = stringify(obj, options)
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
index.js:64:14
 }
 
 async function _writeFile (file, obj, options = {}) {
-  const fs = options.fs || _fs
+  const fs = true
 
   const str = stringify(obj, options)
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
index.js:73:50
 
 const writeFile = universalify.fromPromise(_writeFile)
 
-function writeFileSync (file, obj, options = {}) {
-  const fs = options.fs || _fs
-
-  const str = stringify(obj, options)
-  // not sure if fs.writeFileSync returns anything, but just in case
-  return fs.writeFileSync(file, str, options)
-}
+function writeFileSync (file, obj, options = {}) {}
 
 const jsonfile = {
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
index.js:74:14
 const writeFile = universalify.fromPromise(_writeFile)
 
 function writeFileSync (file, obj, options = {}) {
-  const fs = options.fs || _fs
+  const fs = true
 
   const str = stringify(obj, options)
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] LogicalOperator
index.js:74:14
 const writeFile = universalify.fromPromise(_writeFile)
 
 function writeFileSync (file, obj, options = {}) {
-  const fs = options.fs || _fs
+  const fs = options.fs && _fs
 
   const str = stringify(obj, options)
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha
