[Killed] BooleanLiteral
utils.js:1:51
-function stringify (obj, { EOL = '\n', finalEOL = true, replacer = null, spaces } = {}) {
+function stringify (obj, { EOL = '\n', finalEOL = false, replacer = null, spaces } = {}) {
   const EOF = finalEOL ? EOL : ''
   const str = JSON.stringify(obj, replacer, spaces)
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
utils.js:1:89
-function stringify (obj, { EOL = '\n', finalEOL = true, replacer = null, spaces } = {}) {
-  const EOF = finalEOL ? EOL : ''
-  const str = JSON.stringify(obj, replacer, spaces)
-
-  return str.replace(/\n/g, EOL) + EOF
-}
+function stringify (obj, { EOL = '\n', finalEOL = true, replacer = null, spaces } = {}) {}
 
 function stripBom (content) {
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] StringLiteral
utils.js:2:32
 function stringify (obj, { EOL = '\n', finalEOL = true, replacer = null, spaces } = {}) {
-  const EOF = finalEOL ? EOL : ''
+  const EOF = finalEOL ? EOL : "Stryker was here!"
   const str = JSON.stringify(obj, replacer, spaces)
 
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ArithmeticOperator
utils.js:5:10
   const EOF = finalEOL ? EOL : ''
   const str = JSON.stringify(obj, replacer, spaces)
 
-  return str.replace(/\n/g, EOL) + EOF
+  return str.replace(/\n/g, EOL) - EOF
 }
 
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] BlockStatement
utils.js:8:29
   return str.replace(/\n/g, EOL) + EOF
 }
 
-function stripBom (content) {
-  // we do this because JSON.parse would convert it to a utf8 string if encoding wasn't specified
-  if (Buffer.isBuffer(content)) content = content.toString('utf8')
-  return content.replace(/^\uFEFF/, '')
-}
+function stripBom (content) {}
 
 module.exports = { stringify, stripBom }
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Killed] ConditionalExpression
utils.js:10:7
 
 function stripBom (content) {
   // we do this because JSON.parse would convert it to a utf8 string if encoding wasn't specified
-  if (Buffer.isBuffer(content)) content = content.toString('utf8')
+  if (false) content = content.toString('utf8')
   return content.replace(/^\uFEFF/, '')
 }
killedBy: All tests
statusReason: > jsonfile@6.1.0 unit
> mocha

[Survived] ConditionalExpression
utils.js:10:7
 
 function stripBom (content) {
   // we do this because JSON.parse would convert it to a utf8 string if encoding wasn't specified
-  if (Buffer.isBuffer(content)) content = content.toString('utf8')
+  if (true) content = content.toString('utf8')
   return content.replace(/^\uFEFF/, '')
 }

[Timeout] ObjectLiteral
utils.js:14:18
   return content.replace(/^\uFEFF/, '')
 }
 
-module.exports = { stringify, stripBom }
+module.exports = {}
 
