[Killed] BlockStatement
index.js:5:20
 
 var rules = []
 
-function type(obj) {
-  return Object.prototype.toString.call(obj).slice(8, -1)
-}
+function type(obj) {}
 
 function addRule(match, result) {
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] UnaryOperator
index.js:6:55
 var rules = []
 
 function type(obj) {
-  return Object.prototype.toString.call(obj).slice(8, -1)
+  return Object.prototype.toString.call(obj).slice(8, +1)
 }
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] MethodExpression
index.js:6:10
 var rules = []
 
 function type(obj) {
-  return Object.prototype.toString.call(obj).slice(8, -1)
+  return Object.prototype.toString.call(obj)
 }
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:9:33
   return Object.prototype.toString.call(obj).slice(8, -1)
 }
 
-function addRule(match, result) {
-  rules.unshift([match, result])
-  return plural
-}
+function addRule(match, result) {}
 
 // words like cherry, where a word ends in a y, but the letter before the y is a consonant
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:16:41
 
 // words like cherry, where a word ends in a y, but the letter before the y is a consonant
 // also contains unique rule for words that end with 'quy' (soliloquy)
-addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
+addRule(/[^aeiou]y$|quy$/i, function(w) {})
 
 // words that end with ch, x, s append 'es'
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ArithmeticOperator
index.js:16:62
 
 // words like cherry, where a word ends in a y, but the letter before the y is a consonant
 // also contains unique rule for words that end with 'quy' (soliloquy)
-addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
+addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length + 1) + 'ies' })
 
 // words that end with ch, x, s append 'es'
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:19:35
 addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
 
 // words that end with ch, x, s append 'es'
-addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+addRule(/x$|ch$|s$/i, function(w) {})
 
 // words that maintain latin/greek plural
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:19:48
 addRule(/[^aeiou]y$|quy$/i, function(w) { return w.substr(0, w.length - 1) + 'ies' })
 
 // words that end with ch, x, s append 'es'
-addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
+addRule(/x$|ch$|s$/i, function(w) { return w + "" })
 
 // words that maintain latin/greek plural
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ArithmeticOperator
index.js:22:83
 addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
 
 // words that maintain latin/greek plural
-addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length + 2) + 'i' });
 addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
 addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:22:62
 addRule(/x$|ch$|s$/i, function(w) { return w + 'es' })
 
 // words that maintain latin/greek plural
-addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
+addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) {});
 addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
 addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:23:39
 
 // words that maintain latin/greek plural
 addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
-addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
+addRule(/thesis|crisis/i, function(w) {});
 addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ArithmeticOperator
index.js:23:60
 
 // words that maintain latin/greek plural
 addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
-addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
+addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length + 2) + 'es' });
 addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] MethodExpression
index.js:24:49
 // words that maintain latin/greek plural
 addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
 addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
-addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
+addRule(/appendix|index/i, function(w) { return w + 'ices' });
 
 // stereo -> stereos
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ArithmeticOperator
index.js:24:61
 // words that maintain latin/greek plural
 addRule(/nucleus|syllabus|focus|fungus|cactus/i, function(w) { return w.substr(0, w.length - 2) + 'i' });
 addRule(/thesis|crisis/i, function(w) { return w.substr(0, w.length - 2) + 'es' });
-addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
+addRule(/appendix|index/i, function(w) { return w.substr(0, w.length + 2) + 'ices' });
 
 // stereo -> stereos
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:27:36
 addRule(/appendix|index/i, function(w) { return w.substr(0, w.length - 2) + 'ices' });
 
 // stereo -> stereos
-addRule(/[aeiouy]o$/i, function(w) { return w + 's' });
+addRule(/[aeiouy]o$/i, function(w) {});
 addRule(/[^aeiouy]o$/i, function(w) { return w + 'es' });
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:28:37
 
 // stereo -> stereos
 addRule(/[aeiouy]o$/i, function(w) { return w + 's' });
-addRule(/[^aeiouy]o$/i, function(w) { return w + 'es' });
+addRule(/[^aeiouy]o$/i, function(w) {});
 
 // f/fe ending words gets switched to ves
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:28:50
 
 // stereo -> stereos
 addRule(/[aeiouy]o$/i, function(w) { return w + 's' });
-addRule(/[^aeiouy]o$/i, function(w) { return w + 'es' });
+addRule(/[^aeiouy]o$/i, function(w) { return w + "" });
 
 // f/fe ending words gets switched to ves
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:32:39
 
 // f/fe ending words gets switched to ves
 // unless it's dwarf or roof
-addRule(/(fe?$)/i, function(w, regex) {
-  if (w === 'dwarf' || w === 'roof') {
-    return w + 's'
-  }
-  return w.replace(regex, 'ves')
-})
+addRule(/(fe?$)/i, function(w, regex) {})
 
 addRule('criterion', 'criteria')
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] Regex
index.js:32:9
 
 // f/fe ending words gets switched to ves
 // unless it's dwarf or roof
-addRule(/(fe?$)/i, function(w, regex) {
+addRule(/(fe?)/i, function(w, regex) {
   if (w === 'dwarf' || w === 'roof') {
     return w + 's'
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ConditionalExpression
index.js:33:7
 // f/fe ending words gets switched to ves
 // unless it's dwarf or roof
 addRule(/(fe?$)/i, function(w, regex) {
-  if (w === 'dwarf' || w === 'roof') {
+  if (true) {
     return w + 's'
   }
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] EqualityOperator
index.js:33:7
 // f/fe ending words gets switched to ves
 // unless it's dwarf or roof
 addRule(/(fe?$)/i, function(w, regex) {
-  if (w === 'dwarf' || w === 'roof') {
+  if (w !== 'dwarf' || w === 'roof') {
     return w + 's'
   }
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:36:27
   if (w === 'dwarf' || w === 'roof') {
     return w + 's'
   }
-  return w.replace(regex, 'ves')
+  return w.replace(regex, "")
 })
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Survived] StringLiteral
index.js:40:22
 })
 
 addRule('criterion', 'criteria')
-addRule('bacterium', 'bacteria')
+addRule('bacterium', "")
 addRule('memo', 'memos')
 addRule('cello', 'cellos')

[Killed] StringLiteral
index.js:41:17
 
 addRule('criterion', 'criteria')
 addRule('bacterium', 'bacteria')
-addRule('memo', 'memos')
+addRule('memo', "")
 addRule('cello', 'cellos')
 addRule('die', 'dice')
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:43:16
 addRule('bacterium', 'bacteria')
 addRule('memo', 'memos')
 addRule('cello', 'cellos')
-addRule('die', 'dice')
+addRule('die', "")
 addRule('goose', 'geese')
 addRule('mouse', 'mice')
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:45:9
 addRule('cello', 'cellos')
 addRule('die', 'dice')
 addRule('goose', 'geese')
-addRule('mouse', 'mice')
+addRule("", 'mice')
 addRule('person', 'people')
 addRule('chilli', 'chillies')
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:45:18
 addRule('cello', 'cellos')
 addRule('die', 'dice')
 addRule('goose', 'geese')
-addRule('mouse', 'mice')
+addRule('mouse', "")
 addRule('person', 'people')
 addRule('chilli', 'chillies')
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:49:38
 addRule('person', 'people')
 addRule('chilli', 'chillies')
 
-addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
+addRule(/^(?:wo)?man$/i, function(w) {})
 
 // animals w/ no plural
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:49:62
 addRule('person', 'people')
 addRule('chilli', 'chillies')
 
-addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
+addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, "") })
 
 // animals w/ no plural
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:52:73
 addRule(/^(?:wo)?man$/i, function(w) { return w.replace(/a/, 'e') })
 
 // animals w/ no plural
-addRule(/\b(?:bison|cod|deer|fowl|halibut|moose|sheep)\b/i, function(w) { return w })
+addRule(/\b(?:bison|cod|deer|fowl|halibut|moose|sheep)\b/i, function(w) {})
 
 // singular nouns that end in -s
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:55:14
 addRule(/\b(?:bison|cod|deer|fowl|halibut|moose|sheep)\b/i, function(w) { return w })
 
 // singular nouns that end in -s
-var tools = ['goggle', 'scissor', 'plier', 'tong', 'tweezer']
+var tools = ["", 'scissor', 'plier', 'tong', 'tweezer']
 var clothes = ['trouser', 'pant', 'pantie', 'clothe']
 var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:55:44
 addRule(/\b(?:bison|cod|deer|fowl|halibut|moose|sheep)\b/i, function(w) { return w })
 
 // singular nouns that end in -s
-var tools = ['goggle', 'scissor', 'plier', 'tong', 'tweezer']
+var tools = ['goggle', 'scissor', 'plier', "", 'tweezer']
 var clothes = ['trouser', 'pant', 'pantie', 'clothe']
 var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:56:27
 
 // singular nouns that end in -s
 var tools = ['goggle', 'scissor', 'plier', 'tong', 'tweezer']
-var clothes = ['trouser', 'pant', 'pantie', 'clothe']
+var clothes = ['trouser', "", 'pantie', 'clothe']
 var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
 var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:57:50
 // singular nouns that end in -s
 var tools = ['goggle', 'scissor', 'plier', 'tong', 'tweezer']
 var clothes = ['trouser', 'pant', 'pantie', 'clothe']
-var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
+var games = ['billiard', 'bowl', 'card', 'dart', "", 'draught']
 var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
 var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:57:61
 // singular nouns that end in -s
 var tools = ['goggle', 'scissor', 'plier', 'tong', 'tweezer']
 var clothes = ['trouser', 'pant', 'pantie', 'clothe']
-var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
+var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', ""]
 var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
 var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:58:66
 var tools = ['goggle', 'scissor', 'plier', 'tong', 'tweezer']
 var clothes = ['trouser', 'pant', 'pantie', 'clothe']
 var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
-var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
+var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', ""]
 var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
   'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:58:47
 var tools = ['goggle', 'scissor', 'plier', 'tong', 'tweezer']
 var clothes = ['trouser', 'pant', 'pantie', 'clothe']
 var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
-var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
+var illnesses = ['diabete', 'measle', 'mump', "", 'ricket', 'shingle']
 var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
   'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:59:53
 var clothes = ['trouser', 'pant', 'pantie', 'clothe']
 var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
 var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
-var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
+var misc = ['kudo', 'premise', 'shamble', 'glasse', "", 'jitter',
   'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
   'riche', 'surrounding', 'thank', 'heroic', 'remain', 'amend'
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:59:66
 var clothes = ['trouser', 'pant', 'pantie', 'clothe']
 var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
 var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
-var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
+var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', "",
   'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
   'riche', 'surrounding', 'thank', 'heroic', 'remain', 'amend'
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:60:71
 var games = ['billiard', 'bowl', 'card', 'dart', 'skittle', 'draught']
 var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
 var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
-  'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
+  'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', "", 'tropic',
   'riche', 'surrounding', 'thank', 'heroic', 'remain', 'amend'
 ]
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:61:12
 var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
 var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
   'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
-  'riche', 'surrounding', 'thank', 'heroic', 'remain', 'amend'
+  'riche', "", 'thank', 'heroic', 'remain', 'amend'
 ]
 addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:61:56
 var illnesses = ['diabete', 'measle', 'mump', 'rabie', 'ricket', 'shingle']
 var misc = ['kudo', 'premise', 'shamble', 'glasse', 'spectacle', 'jitter',
   'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
-  'riche', 'surrounding', 'thank', 'heroic', 'remain', 'amend'
+  'riche', 'surrounding', 'thank', 'heroic', 'remain', ""
 ]
 addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:63:116
   'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
   'riche', 'surrounding', 'thank', 'heroic', 'remain', 'amend'
 ]
-addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
+addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) {})
 
 // most words ending in -ics are the same in their plural form
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] StringLiteral
index.js:63:20
   'alm', 'fece', 'bowel', 'sud', 'entrail', 'electronic', 'outskirt', 'odd', 'tropic',
   'riche', 'surrounding', 'thank', 'heroic', 'remain', 'amend'
 ]
-addRule(new RegExp('\\b(?:' + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
+addRule(new RegExp("" + tools.concat(clothes, games, illnesses, misc).join('|') + ')s\\b', 'i'), function(w) { return w})
 
 // most words ending in -ics are the same in their plural form
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js


/Users/ANON/Documents/research/LLMTestGeneration/subject_repositories/plural/.stryker-tmp/sandbox-7Kna9k/index.js:186
        ^

[Killed] BlockStatement
index.js:67:30
 
 // most words ending in -ics are the same in their plural form
 // mathematics, statistics, linguistics, classics, acoustics
-addRule(/ics$/i, function(w) { return w })
+addRule(/ics$/i, function(w) {})
 
 // uncountable
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:70:122
 addRule(/ics$/i, function(w) { return w })
 
 // uncountable
-addRule(/\b(?:tea|sugar|water|air|rice|knowledge|beauty|anger|fear|love|money|research|safety|evidence)\b/i, function(w) { return w })
+addRule(/\b(?:tea|sugar|water|air|rice|knowledge|beauty|anger|fear|love|money|research|safety|evidence)\b/i, function(w) {})
 
 function plural(word, num) {
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:72:28
 // uncountable
 addRule(/\b(?:tea|sugar|water|air|rice|knowledge|beauty|anger|fear|love|money|research|safety|evidence)\b/i, function(w) { return w })
 
-function plural(word, num) {
-  var i
-    , rule
-
-  if (num !== 1 || num === undefined) {
-    for (i = 0; i < rules.length; i++) {
-      rule = rules[i]
-
-      if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
-        return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
-      }
-      if (type(rule[0]) === 'String' && rule[0] === word) {
-        return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
-      }
-
-    }
-
-    return word + 's'
-  }
-  return word
-}
+function plural(word, num) {}
 
 module.exports = plural
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:76:39
   var i
     , rule
 
-  if (num !== 1 || num === undefined) {
-    for (i = 0; i < rules.length; i++) {
-      rule = rules[i]
-
-      if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
-        return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
-      }
-      if (type(rule[0]) === 'String' && rule[0] === word) {
-        return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
-      }
-
-    }
-
-    return word + 's'
-  }
+  if (num !== 1 || num === undefined) {}
   return word
 }
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ConditionalExpression
index.js:76:7
   var i
     , rule
 
-  if (num !== 1 || num === undefined) {
+  if (false) {
     for (i = 0; i < rules.length; i++) {
       rule = rules[i]
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] EqualityOperator
index.js:77:17
     , rule
 
   if (num !== 1 || num === undefined) {
-    for (i = 0; i < rules.length; i++) {
+    for (i = 0; i <= rules.length; i++) {
       rule = rules[i]
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ConditionalExpression
index.js:77:17
     , rule
 
   if (num !== 1 || num === undefined) {
-    for (i = 0; i < rules.length; i++) {
+    for (i = 0; false; i++) {
       rule = rules[i]
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ConditionalExpression
index.js:80:11
     for (i = 0; i < rules.length; i++) {
       rule = rules[i]
 
-      if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
+      if (false) {
         return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
       }
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] EqualityOperator
index.js:80:11
     for (i = 0; i < rules.length; i++) {
       rule = rules[i]
 
-      if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
+      if (type(rule[0]) !== 'RegExp' && rule[0].test(word)) {
         return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
       }
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] EqualityOperator
index.js:81:16
       rule = rules[i]
 
       if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
-        return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
+        return type(rule[1]) !== 'Function' ? rule[1](word, rule[0]) : rule[1]
       }
       if (type(rule[0]) === 'String' && rule[0] === word) {
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ConditionalExpression
index.js:81:16
       rule = rules[i]
 
       if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
-        return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
+        return false ? rule[1](word, rule[0]) : rule[1]
       }
       if (type(rule[0]) === 'String' && rule[0] === word) {
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] LogicalOperator
index.js:83:11
       if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
         return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
       }
-      if (type(rule[0]) === 'String' && rule[0] === word) {
+      if (type(rule[0]) === 'String' || rule[0] === word) {
         return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
       }
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ConditionalExpression
index.js:83:11
       if (type(rule[0]) === 'RegExp' && rule[0].test(word)) {
         return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
       }
-      if (type(rule[0]) === 'String' && rule[0] === word) {
+      if (false) {
         return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
       }
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] EqualityOperator
index.js:84:16
         return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
       }
       if (type(rule[0]) === 'String' && rule[0] === word) {
-        return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+        return type(rule[1]) !== 'Function' ? rule[1](word) : rule[1]
       }
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ConditionalExpression
index.js:84:16
         return type(rule[1]) === 'Function' ? rule[1](word, rule[0]) : rule[1]
       }
       if (type(rule[0]) === 'String' && rule[0] === word) {
-        return type(rule[1]) === 'Function' ? rule[1](word) : rule[1]
+        return true ? rule[1](word) : rule[1]
       }
 
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:98:43
 
 module.exports.addRule = addRule
 
-module.exports.unmonkeyPatch = function() {
-  String.prototype.plural = null;
-}
+module.exports.unmonkeyPatch = function() {}
 
 module.exports.monkeyPatch = function() {
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:102:41
   String.prototype.plural = null;
 }
 
-module.exports.monkeyPatch = function() {
-  if (String.prototype.plural === undefined) {
-    String.prototype.plural = function(num) {
-      return plural(this, num)
-    }
-  }
-  else {
-    throw new Error('Unable to add plural function to String object')
-  }
-}
+module.exports.monkeyPatch = function() {}
 
 module.exports.VERSION = require('./package.json').version
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] BlockStatement
index.js:103:46
 }
 
 module.exports.monkeyPatch = function() {
-  if (String.prototype.plural === undefined) {
-    String.prototype.plural = function(num) {
-      return plural(this, num)
-    }
-  }
+  if (String.prototype.plural === undefined) {}
   else {
     throw new Error('Unable to add plural function to String object')
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Killed] ConditionalExpression
index.js:103:7
 }
 
 module.exports.monkeyPatch = function() {
-  if (String.prototype.plural === undefined) {
+  if (false) {
     String.prototype.plural = function(num) {
       return plural(this, num)
killedBy: All tests
statusReason: > plural@1.1.0 test
> mocha test.js

[Survived] BlockStatement
index.js:104:45
 
 module.exports.monkeyPatch = function() {
   if (String.prototype.plural === undefined) {
-    String.prototype.plural = function(num) {
-      return plural(this, num)
-    }
+    String.prototype.plural = function(num) {}
   }
   else {

[Survived] BlockStatement
index.js:108:8
       return plural(this, num)
     }
   }
-  else {
-    throw new Error('Unable to add plural function to String object')
-  }
+  else {}
 }
 
