[Killed] EqualityOperator
pull.js:5:7
 
 module.exports = function pull (a) {
   var length = arguments.length
-  if (typeof a === 'function' && a.length === 1) {
+  if (typeof a !== 'function' && a.length === 1) {
     var args = new Array(length)
     for(var i = 0; i < length; i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
pull.js:5:7
 
 module.exports = function pull (a) {
   var length = arguments.length
-  if (typeof a === 'function' && a.length === 1) {
+  if (typeof a === 'function' || a.length === 1) {
     var args = new Array(length)
     for(var i = 0; i < length; i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
pull.js:7:20
   var length = arguments.length
   if (typeof a === 'function' && a.length === 1) {
     var args = new Array(length)
-    for(var i = 0; i < length; i++)
+    for(var i = 0; false; i++)
       args[i] = arguments[i]
     return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] EqualityOperator
pull.js:7:20
   var length = arguments.length
   if (typeof a === 'function' && a.length === 1) {
     var args = new Array(length)
-    for(var i = 0; i < length; i++)
+    for(var i = 0; i >= length; i++)
       args[i] = arguments[i]
     return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
pull.js:9:28
     var args = new Array(length)
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
-    return function (read) {
-      if (args == null) {
-        throw new TypeError("partial sink should only be called once!")
-      }
-
-      // Grab the reference after the check, because it's always an array now
-      // (engines like that kind of consistency).
-      var ref = args
-      args = null
-
-      // Prioritize common case of small number of pulls.
-      switch (length) {
-      case 1: return pull(read, ref[0])
-      case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
-      default:
-        ref.unshift(read)
-        return pull.apply(null, ref)
-      }
-    }
+    return function (read) {}
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
pull.js:10:11
     for(var i = 0; i < length; i++)
       args[i] = arguments[i]
     return function (read) {
-      if (args == null) {
+      if (true) {
         throw new TypeError("partial sink should only be called once!")
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] ConditionalExpression
pull.js:21:7
 
       // Prioritize common case of small number of pulls.
       switch (length) {
-      case 1: return pull(read, ref[0])
+      case 1:
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])

[Survived] ConditionalExpression
pull.js:22:7
       // Prioritize common case of small number of pulls.
       switch (length) {
       case 1: return pull(read, ref[0])
-      case 2: return pull(read, ref[0], ref[1])
+      case 2:
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])

[Survived] ConditionalExpression
pull.js:23:7
       switch (length) {
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
-      case 3: return pull(read, ref[0], ref[1], ref[2])
+      case 3:
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
       default:

[Survived] ConditionalExpression
pull.js:24:7
       case 1: return pull(read, ref[0])
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
-      case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
+      case 4:
       default:
         ref.unshift(read)

[Survived] ConditionalExpression
pull.js:25:7
       case 2: return pull(read, ref[0], ref[1])
       case 3: return pull(read, ref[0], ref[1], ref[2])
       case 4: return pull(read, ref[0], ref[1], ref[2], ref[3])
-      default:
-        ref.unshift(read)
-        return pull.apply(null, ref)
+      default:
       }
     }

[Killed] EqualityOperator
pull.js:38:19
     read = read.source
   }
 
-  for (var i = 1; i < length; i++) {
+  for (var i = 1; i >= length; i++) {
     var s = arguments[i]
     if (typeof s === 'function') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
pull.js:38:36
     read = read.source
   }
 
-  for (var i = 1; i < length; i++) {
-    var s = arguments[i]
-    if (typeof s === 'function') {
-      read = s(read)
-    } else if (s && typeof s === 'object') {
-      s.sink(read)
-      read = s.source
-    }
-  }
+  for (var i = 1; i < length; i++) {}
 
   return read
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
pull.js:40:34
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
-      read = s(read)
-    } else if (s && typeof s === 'object') {
+    if (typeof s === 'function') {} else if (s && typeof s === 'object') {
       s.sink(read)
       read = s.source
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
pull.js:40:9
 
   for (var i = 1; i < length; i++) {
     var s = arguments[i]
-    if (typeof s === 'function') {
+    if (false) {
       read = s(read)
     } else if (s && typeof s === 'object') {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] ConditionalExpression
pull.js:42:16
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (true) {
       s.sink(read)
       read = s.source

[Survived] ConditionalExpression
pull.js:42:21
     var s = arguments[i]
     if (typeof s === 'function') {
       read = s(read)
-    } else if (s && typeof s === 'object') {
+    } else if (s && true) {
       s.sink(read)
       read = s.source
