[Killed] BlockStatement
sinks/collect.js:5:40
 
 var reduce = require('./reduce')
 
-module.exports = function collect (cb) {
-  return reduce(function (arr, item) {
-    arr.push(item)
-    return arr
-  }, [], cb)
-}
+module.exports = function collect (cb) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/collect.js:6:38
 var reduce = require('./reduce')
 
 module.exports = function collect (cb) {
-  return reduce(function (arr, item) {
-    arr.push(item)
-    return arr
-  }, [], cb)
+  return reduce(function (arr, item) {}, [], cb)
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
