[Killed] BlockStatement
sinks/concat.js:5:39
 
 var reduce = require('./reduce')
 
-module.exports = function concat (cb) {
-  return reduce(function (a, b) {
-    return a + b
-  }, '', cb)
-}
+module.exports = function concat (cb) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/concat.js:6:33
 var reduce = require('./reduce')
 
 module.exports = function concat (cb) {
-  return reduce(function (a, b) {
-    return a + b
-  }, '', cb)
+  return reduce(function (a, b) {}, '', cb)
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ArithmeticOperator
sinks/concat.js:7:12
 
 module.exports = function concat (cb) {
   return reduce(function (a, b) {
-    return a + b
+    return a - b
   }, '', cb)
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
