[Survived] BooleanLiteral
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (done) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Survived] ConditionalExpression
sinks/drain.js:8:7
 
   // Declared here so that it captures the drain's stack trace
   var doneLackingErr
-  if (!done) {
+  if (true) {
     doneLackingErr = new Error('no done callback supplied')
   }

[Killed] ConditionalExpression
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(true) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] ConditionalExpression
sinks/drain.js:14:8
 
   function sink (_read) {
     read = _read
-    if(abort) return sink.abort()
+    if(false) return sink.abort()
     //this function is much simpler to write if you
     //just use recursion, but by using a while loop

[Killed] BooleanLiteral
sinks/drain.js:19:20
     //just use recursion, but by using a while loop
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
-        var loop = true, cbed = false
+        var loop = false, cbed = false
         while(loop) {
           cbed = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] BooleanLiteral
sinks/drain.js:19:33
     //just use recursion, but by using a while loop
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
-        var loop = true, cbed = false
+        var loop = true, cbed = true
         while(loop) {
           cbed = false

[Killed] ConditionalExpression
sinks/drain.js:20:15
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
         var loop = true, cbed = false
-        while(loop) {
+        while(false) {
           cbed = false
           read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] BlockStatement
sinks/drain.js:20:21
     //we do not blow the stack if the stream happens to be sync.
     ;(function next() {
         var loop = true, cbed = false
-        while(loop) {
-          cbed = false
-          read(null, function (end, data) {
-            cbed = true
-            if(end = end || abort) {
-              loop = false
-              if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
-                console.warn(doneLackingErr)
-                throw end
-              }
-            }
-            else if(op && false === op(data) || abort) {
-              loop = false
-              read(abort || true, done || function () {})
-            }
-            else if(!loop){
-              next()
-            }
-          })
-          if(!cbed) {
-            loop = false
-            return
-          }
-        }
+        while(loop) {}
       })()
   }

[Timeout] BooleanLiteral
sinks/drain.js:21:18
     ;(function next() {
         var loop = true, cbed = false
         while(loop) {
-          cbed = false
+          cbed = true
           read(null, function (end, data) {
             cbed = true

[Killed] BlockStatement
sinks/drain.js:22:43
         var loop = true, cbed = false
         while(loop) {
           cbed = false
-          read(null, function (end, data) {
-            cbed = true
-            if(end = end || abort) {
-              loop = false
-              if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
-                console.warn(doneLackingErr)
-                throw end
-              }
-            }
-            else if(op && false === op(data) || abort) {
-              loop = false
-              read(abort || true, done || function () {})
-            }
-            else if(!loop){
-              next()
-            }
-          })
+          read(null, function (end, data) {})
           if(!cbed) {
             loop = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sinks/drain.js:23:20
         while(loop) {
           cbed = false
           read(null, function (end, data) {
-            cbed = true
+            cbed = false
             if(end = end || abort) {
               loop = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:24:22
           cbed = false
           read(null, function (end, data) {
             cbed = true
-            if(end = end || abort) {
+            if(end = true) {
               loop = false
               if(done) done(end === true ? null : end)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:24:16
           cbed = false
           read(null, function (end, data) {
             cbed = true
-            if(end = end || abort) {
+            if(true) {
               loop = false
               if(done) done(end === true ? null : end)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] BooleanLiteral
sinks/drain.js:25:22
           read(null, function (end, data) {
             cbed = true
             if(end = end || abort) {
-              loop = false
+              loop = true
               if(done) done(end === true ? null : end)
               else if(end && end !== true) {

[Killed] ConditionalExpression
sinks/drain.js:26:18
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(false) done(end === true ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:26:29
             cbed = true
             if(end = end || abort) {
               loop = false
-              if(done) done(end === true ? null : end)
+              if(done) done(false ? null : end)
               else if(end && end !== true) {
                 console.warn(doneLackingErr)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] BlockStatement
sinks/drain.js:27:44
             if(end = end || abort) {
               loop = false
               if(done) done(end === true ? null : end)
-              else if(end && end !== true) {
-                console.warn(doneLackingErr)
-                throw end
-              }
+              else if(end && end !== true) {}
             }
             else if(op && false === op(data) || abort) {

[Killed] ConditionalExpression
sinks/drain.js:32:21
                 throw end
               }
             }
-            else if(op && false === op(data) || abort) {
+            else if(true) {
               loop = false
               read(abort || true, done || function () {})
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
sinks/drain.js:32:21
                 throw end
               }
             }
-            else if(op && false === op(data) || abort) {
+            else if(op && false === op(data) && abort) {
               loop = false
               read(abort || true, done || function () {})
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sinks/drain.js:33:22
               }
             }
             else if(op && false === op(data) || abort) {
-              loop = false
+              loop = true
               read(abort || true, done || function () {})
             }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:34:35
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || true, true)
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:34:35
             }
             else if(op && false === op(data) || abort) {
               loop = false
-              read(abort || true, done || function () {})
+              read(abort || true, false)
             }
             else if(!loop){
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:36:21
               loop = false
               read(abort || true, done || function () {})
             }
-            else if(!loop){
+            else if(true){
               next()
             }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:40:14
               next()
             }
           })
-          if(!cbed) {
+          if(true) {
             loop = false
             return
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sinks/drain.js:41:20
             }
           })
           if(!cbed) {
-            loop = false
+            loop = true
             return
           }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/drain.js:48:35
       })()
   }
 
-  sink.abort = function (err, cb) {
-    if('function' == typeof err)
-      cb = err, err = true
-    abort = err || true
-    if(read) return read(abort, cb || function () {})
-  }
+  sink.abort = function (err, cb) {}
 
   return sink
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] EqualityOperator
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if('function' != typeof err)
       cb = err, err = true
     abort = err || true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:49:8
   }
 
   sink.abort = function (err, cb) {
-    if('function' == typeof err)
+    if(true)
       cb = err, err = true
     abort = err || true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] BooleanLiteral
sinks/drain.js:50:23
 
   sink.abort = function (err, cb) {
     if('function' == typeof err)
-      cb = err, err = true
+      cb = err, err = false
     abort = err || true
     if(read) return read(abort, cb || function () {})

[Killed] LogicalOperator
sinks/drain.js:51:13
   sink.abort = function (err, cb) {
     if('function' == typeof err)
       cb = err, err = true
-    abort = err || true
+    abort = err && true
     if(read) return read(abort, cb || function () {})
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sinks/drain.js:51:20
   sink.abort = function (err, cb) {
     if('function' == typeof err)
       cb = err, err = true
-    abort = err || true
+    abort = err || false
     if(read) return read(abort, cb || function () {})
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/drain.js:52:33
     if('function' == typeof err)
       cb = err, err = true
     abort = err || true
-    if(read) return read(abort, cb || function () {})
+    if(read) return read(abort, true)
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
