[Killed] BlockStatement
sinks/find.js:3:17
 'use strict'
 
-function id (e) { return e }
+function id (e) {}
 var prop = require('../util/prop')
 var drain = require('./drain')
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/find.js:7:43
 var prop = require('../util/prop')
 var drain = require('./drain')
 
-module.exports = function find (test, cb) {
-  var ended = false
-  if(!cb)
-    cb = test, test = id
-  else
-    test = prop(test) || id
-
-  return drain(function (data) {
-    if(test(data)) {
-      ended = true
-      cb(null, data)
-    return false
-    }
-  }, function (err) {
-    if(ended) return //already called back
-    cb(err === true ? null : err, null)
-  })
-}
+module.exports = function find (test, cb) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sinks/find.js:8:15
 var drain = require('./drain')
 
 module.exports = function find (test, cb) {
-  var ended = false
+  var ended = true
   if(!cb)
     cb = test, test = id
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sinks/find.js:9:6
 
 module.exports = function find (test, cb) {
   var ended = false
-  if(!cb)
+  if(cb)
     cb = test, test = id
   else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/find.js:9:6
 
 module.exports = function find (test, cb) {
   var ended = false
-  if(!cb)
+  if(true)
     cb = test, test = id
   else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/find.js:12:12
   if(!cb)
     cb = test, test = id
   else
-    test = prop(test) || id
+    test = false
 
   return drain(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
sinks/find.js:12:12
   if(!cb)
     cb = test, test = id
   else
-    test = prop(test) || id
+    test = prop(test) && id
 
   return drain(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/find.js:14:32
   else
     test = prop(test) || id
 
-  return drain(function (data) {
-    if(test(data)) {
-      ended = true
-      cb(null, data)
-    return false
-    }
-  }, function (err) {
+  return drain(function (data) {}, function (err) {
     if(ended) return //already called back
     cb(err === true ? null : err, null)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/find.js:15:8
     test = prop(test) || id
 
   return drain(function (data) {
-    if(test(data)) {
+    if(true) {
       ended = true
       cb(null, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/find.js:15:20
     test = prop(test) || id
 
   return drain(function (data) {
-    if(test(data)) {
-      ended = true
-      cb(null, data)
-    return false
-    }
+    if(test(data)) {}
   }, function (err) {
     if(ended) return //already called back
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sinks/find.js:16:15
 
   return drain(function (data) {
     if(test(data)) {
-      ended = true
+      ended = false
       cb(null, data)
     return false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sinks/find.js:18:12
     if(test(data)) {
       ended = true
       cb(null, data)
-    return false
+    return true
     }
   }, function (err) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/find.js:20:21
       cb(null, data)
     return false
     }
-  }, function (err) {
-    if(ended) return //already called back
-    cb(err === true ? null : err, null)
-  })
+  }, function (err) {})
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/find.js:21:8
     return false
     }
   }, function (err) {
-    if(ended) return //already called back
+    if(false) return //already called back
     cb(err === true ? null : err, null)
   })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/find.js:21:8
     return false
     }
   }, function (err) {
-    if(ended) return //already called back
+    if(true) return //already called back
     cb(err === true ? null : err, null)
   })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] BooleanLiteral
sinks/find.js:22:16
     }
   }, function (err) {
     if(ended) return //already called back
-    cb(err === true ? null : err, null)
+    cb(err === false ? null : err, null)
   })
 }

[Survived] ConditionalExpression
sinks/find.js:22:8
     }
   }, function (err) {
     if(ended) return //already called back
-    cb(err === true ? null : err, null)
+    cb(false ? null : err, null)
   })
 }
