[Survived] BlockStatement
sinks/log.js:5:38
 
 var drain = require('./drain')
 
-module.exports = function log (done) {
-  return drain(function (data) {
-    console.log(data)
-  }, done)
-}
+module.exports = function log (done) {}
 

[Survived] BlockStatement
sinks/log.js:6:32
 var drain = require('./drain')
 
 module.exports = function log (done) {
-  return drain(function (data) {
-    console.log(data)
-  }, done)
+  return drain(function (data) {}, done)
 }
 
