[Killed] BlockStatement
sinks/on-end.js:5:40
 
 var drain = require('./drain')
 
-module.exports = function onEnd (done) {
-  return drain(null, done)
-}
+module.exports = function onEnd (done) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
