[Killed] BlockStatement
sinks/reduce.js:5:54
 
 var drain = require('./drain')
 
-module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
-  var sink = drain(function (data) {
-    acc = reducer(acc, data)
-  }, function (err) {
-    cb(err, acc)
-  })
-  if (arguments.length === 2)
-    return function (source) {
-      source(null, function (end, data) {
-        //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
-        acc = data; sink(source)
-      })
-    }
-  else
-    return sink
-}
+module.exports = function reduce (reducer, acc, cb ) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/reduce.js:6:6
 var drain = require('./drain')
 
 module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
+  if(true) cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/reduce.js:6:6
 var drain = require('./drain')
 
 module.exports = function reduce (reducer, acc, cb ) {
-  if(!cb) cb = acc, acc = null
+  if(false) cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/reduce.js:7:36
 
 module.exports = function reduce (reducer, acc, cb ) {
   if(!cb) cb = acc, acc = null
-  var sink = drain(function (data) {
-    acc = reducer(acc, data)
-  }, function (err) {
+  var sink = drain(function (data) {}, function (err) {
     cb(err, acc)
   })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/reduce.js:9:21
   if(!cb) cb = acc, acc = null
   var sink = drain(function (data) {
     acc = reducer(acc, data)
-  }, function (err) {
-    cb(err, acc)
-  })
+  }, function (err) {})
   if (arguments.length === 2)
     return function (source) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/reduce.js:12:7
   }, function (err) {
     cb(err, acc)
   })
-  if (arguments.length === 2)
+  if (true)
     return function (source) {
       source(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/reduce.js:13:30
     cb(err, acc)
   })
   if (arguments.length === 2)
-    return function (source) {
-      source(null, function (end, data) {
-        //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
-        acc = data; sink(source)
-      })
-    }
+    return function (source) {}
   else
     return sink
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sinks/reduce.js:14:41
   })
   if (arguments.length === 2)
     return function (source) {
-      source(null, function (end, data) {
-        //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
-        acc = data; sink(source)
-      })
+      source(null, function (end, data) {})
     }
   else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sinks/reduce.js:16:12
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(true) return cb(end === true ? null : end)
         acc = data; sink(source)
       })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] ConditionalExpression
sinks/reduce.js:16:12
     return function (source) {
       source(null, function (end, data) {
         //if ended immediately, and no initial...
-        if(end) return cb(end === true ? null : end)
+        if(false) return cb(end === true ? null : end)
         acc = data; sink(source)
       })
