[Killed] BlockStatement
sources/count.js:3:39
 'use strict'
 
-module.exports = function count (max) {
-  var i = 0; max = max || Infinity
-  return function (end, cb) {
-    if(end) return cb && cb(end)
-    if(i > max)
-      return cb(true)
-    cb(null, i++)
-  }
-}
+module.exports = function count (max) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sources/count.js:4:20
 'use strict'
 
 module.exports = function count (max) {
-  var i = 0; max = max || Infinity
+  var i = 0; max = true
   return function (end, cb) {
     if(end) return cb && cb(end)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sources/count.js:4:20
 'use strict'
 
 module.exports = function count (max) {
-  var i = 0; max = max || Infinity
+  var i = 0; max = false
   return function (end, cb) {
     if(end) return cb && cb(end)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sources/count.js:5:29
 
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
-  return function (end, cb) {
-    if(end) return cb && cb(end)
-    if(i > max)
-      return cb(true)
-    cb(null, i++)
-  }
+  return function (end, cb) {}
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
sources/count.js:6:20
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return cb || cb(end)
     if(i > max)
       return cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sources/count.js:6:20
 module.exports = function count (max) {
   var i = 0; max = max || Infinity
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return true
     if(i > max)
       return cb(true)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] EqualityOperator
sources/count.js:7:8
   var i = 0; max = max || Infinity
   return function (end, cb) {
     if(end) return cb && cb(end)
-    if(i > max)
+    if(i <= max)
       return cb(true)
     cb(null, i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sources/count.js:7:8
   var i = 0; max = max || Infinity
   return function (end, cb) {
     if(end) return cb && cb(end)
-    if(i > max)
+    if(false)
       return cb(true)
     cb(null, i++)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
