[Killed] BlockStatement
sources/empty.js:3:36
 'use strict'
 //a stream that ends immediately.
-module.exports = function empty () {
-  return function (abort, cb) {
-    cb(true)
-  }
-}
+module.exports = function empty () {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sources/empty.js:4:31
 'use strict'
 //a stream that ends immediately.
 module.exports = function empty () {
-  return function (abort, cb) {
-    cb(true)
-  }
+  return function (abort, cb) {}
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] BooleanLiteral
sources/empty.js:5:8
 //a stream that ends immediately.
 module.exports = function empty () {
   return function (abort, cb) {
-    cb(true)
+    cb(false)
   }
 }
