[Killed] BlockStatement
sources/error.js:3:39
 'use strict'
 //a stream that errors immediately.
-module.exports = function error (err) {
-  return function (abort, cb) {
-    cb(err)
-  }
-}
+module.exports = function error (err) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sources/error.js:4:31
 'use strict'
 //a stream that errors immediately.
 module.exports = function error (err) {
-  return function (abort, cb) {
-    cb(err)
-  }
+  return function (abort, cb) {}
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
