[Killed] BlockStatement
sources/infinite.js:2:47
 'use strict'
-module.exports = function infinite (generate) {
-  generate = generate || Math.random
-  return function (end, cb) {
-    if(end) return cb && cb(end)
-    return cb(null, generate())
-  }
-}
+module.exports = function infinite (generate) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sources/infinite.js:3:14
 'use strict'
 module.exports = function infinite (generate) {
-  generate = generate || Math.random
+  generate = false
   return function (end, cb) {
     if(end) return cb && cb(end)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
sources/infinite.js:3:14
 'use strict'
 module.exports = function infinite (generate) {
-  generate = generate || Math.random
+  generate = generate && Math.random
   return function (end, cb) {
     if(end) return cb && cb(end)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sources/infinite.js:4:29
 'use strict'
 module.exports = function infinite (generate) {
   generate = generate || Math.random
-  return function (end, cb) {
-    if(end) return cb && cb(end)
-    return cb(null, generate())
-  }
+  return function (end, cb) {}
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sources/infinite.js:5:20
 module.exports = function infinite (generate) {
   generate = generate || Math.random
   return function (end, cb) {
-    if(end) return cb && cb(end)
+    if(end) return false
     return cb(null, generate())
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
