[Killed] BlockStatement
sources/keys.js:3:36
 'use strict'
 var values = require('./values')
-module.exports = function (object) {
-  return values(Object.keys(object))
-}
+module.exports = function (object) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
