[Killed] BlockStatement
sources/once.js:4:49
 'use strict'
 var abortCb = require('../util/abort-cb')
 
-module.exports = function once (value, onAbort) {
-  return function (abort, cb) {
-    if(abort)
-      return abortCb(cb, abort, onAbort)
-    if(value != null) {
-      var _value = value; value = null
-      cb(null, _value)
-    } else
-      cb(true)
-  }
-}
+module.exports = function once (value, onAbort) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sources/once.js:5:31
 var abortCb = require('../util/abort-cb')
 
 module.exports = function once (value, onAbort) {
-  return function (abort, cb) {
-    if(abort)
-      return abortCb(cb, abort, onAbort)
-    if(value != null) {
-      var _value = value; value = null
-      cb(null, _value)
-    } else
-      cb(true)
-  }
+  return function (abort, cb) {}
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] ConditionalExpression
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(true)
       return abortCb(cb, abort, onAbort)
     if(value != null) {

[Survived] ConditionalExpression
sources/once.js:6:8
 
 module.exports = function once (value, onAbort) {
   return function (abort, cb) {
-    if(abort)
+    if(false)
       return abortCb(cb, abort, onAbort)
     if(value != null) {

[Killed] BlockStatement
sources/once.js:8:23
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(value != null) {
-      var _value = value; value = null
-      cb(null, _value)
-    } else
+    if(value != null) {} else
       cb(true)
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sources/once.js:8:8
   return function (abort, cb) {
     if(abort)
       return abortCb(cb, abort, onAbort)
-    if(value != null) {
+    if(false) {
       var _value = value; value = null
       cb(null, _value)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
