[Killed] BlockStatement
sources/values.js:4:51
 'use strict'
 var abortCb = require('../util/abort-cb')
 
-module.exports = function values (array, onAbort) {
-  if(!array)
-    return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
-      return cb(true)
-    }
-  if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
-      return array[k]
-    })
-  var i = 0
-  return function (abort, cb) {
-    if(abort)
-      return abortCb(cb, abort, onAbort)
-    if(i >= array.length)
-      cb(true)
-    else
-      cb(null, array[i++])
-  }
-}
+module.exports = function values (array, onAbort) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(array)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
sources/values.js:5:6
 var abortCb = require('../util/abort-cb')
 
 module.exports = function values (array, onAbort) {
-  if(!array)
+  if(true)
     return function (abort, cb) {
       if(abort) return abortCb(cb, abort, onAbort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] BlockStatement
sources/values.js:6:33
 
 module.exports = function values (array, onAbort) {
   if(!array)
-    return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
-      return cb(true)
-    }
+    return function (abort, cb) {}
   if(!Array.isArray(array))
     array = Object.keys(array).map(function (k) {

[Survived] ConditionalExpression
sources/values.js:7:10
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(false) return abortCb(cb, abort, onAbort)
       return cb(true)
     }

[Survived] ConditionalExpression
sources/values.js:7:10
 module.exports = function values (array, onAbort) {
   if(!array)
     return function (abort, cb) {
-      if(abort) return abortCb(cb, abort, onAbort)
+      if(true) return abortCb(cb, abort, onAbort)
       return cb(true)
     }

[Timeout] ConditionalExpression
sources/values.js:10:6
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(false)
     array = Object.keys(array).map(function (k) {
       return array[k]

[Timeout] BooleanLiteral
sources/values.js:10:6
       if(abort) return abortCb(cb, abort, onAbort)
       return cb(true)
     }
-  if(!Array.isArray(array))
+  if(Array.isArray(array))
     array = Object.keys(array).map(function (k) {
       return array[k]

[Killed] BlockStatement
sources/values.js:11:49
       return cb(true)
     }
   if(!Array.isArray(array))
-    array = Object.keys(array).map(function (k) {
-      return array[k]
-    })
+    array = Object.keys(array).map(function (k) {})
   var i = 0
   return function (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
sources/values.js:15:31
       return array[k]
     })
   var i = 0
-  return function (abort, cb) {
-    if(abort)
-      return abortCb(cb, abort, onAbort)
-    if(i >= array.length)
-      cb(true)
-    else
-      cb(null, array[i++])
-  }
+  return function (abort, cb) {}
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
