[Killed] BooleanLiteral
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(map) return id
   map = prop(map)
   var busy = false, abortCb, aborted
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:7:6
 var prop = require('../util/prop')
 
 module.exports = function asyncMap (map) {
-  if(!map) return id
+  if(true) return id
   map = prop(map)
   var busy = false, abortCb, aborted
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/async-map.js:9:14
 module.exports = function asyncMap (map) {
   if(!map) return id
   map = prop(map)
-  var busy = false, abortCb, aborted
+  var busy = true, abortCb, aborted
   return function (read) {
     return function next (abort, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] ConditionalExpression
throughs/async-map.js:12:10
   var busy = false, abortCb, aborted
   return function (read) {
     return function next (abort, cb) {
-      if(aborted) return cb(aborted)
+      if(false) return cb(aborted)
       if(abort) {
         aborted = abort

[Timeout] ConditionalExpression
throughs/async-map.js:12:10
   var busy = false, abortCb, aborted
   return function (read) {
     return function next (abort, cb) {
-      if(aborted) return cb(aborted)
+      if(true) return cb(aborted)
       if(abort) {
         aborted = abort

[Killed] ConditionalExpression
throughs/async-map.js:13:10
   return function (read) {
     return function next (abort, cb) {
       if(aborted) return cb(aborted)
-      if(abort) {
+      if(false) {
         aborted = abort
         if(!busy) read(abort, function (err) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/async-map.js:13:17
   return function (read) {
     return function next (abort, cb) {
       if(aborted) return cb(aborted)
-      if(abort) {
-        aborted = abort
-        if(!busy) read(abort, function (err) {
-          //incase the source has already ended normally,
-          //we should pass our own error.
-          cb(abort)
-        })
-        else read(abort, function (err) {
-          //if we are still busy, wait for the mapper to complete.
-          if(busy) abortCb = cb
-          else cb(abort)
-        })
-      }
+      if(abort) {}
       else
         read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/async-map.js:15:46
       if(aborted) return cb(aborted)
       if(abort) {
         aborted = abort
-        if(!busy) read(abort, function (err) {
-          //incase the source has already ended normally,
-          //we should pass our own error.
-          cb(abort)
-        })
+        if(!busy) read(abort, function (err) {})
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/async-map.js:20:41
           //we should pass our own error.
           cb(abort)
         })
-        else read(abort, function (err) {
-          //if we are still busy, wait for the mapper to complete.
-          if(busy) abortCb = cb
-          else cb(abort)
-        })
+        else read(abort, function (err) {})
       }
       else
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:22:14
         })
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
-          if(busy) abortCb = cb
+          if(false) abortCb = cb
           else cb(abort)
         })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:22:14
         })
         else read(abort, function (err) {
           //if we are still busy, wait for the mapper to complete.
-          if(busy) abortCb = cb
+          if(true) abortCb = cb
           else cb(abort)
         })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/async-map.js:27:41
         })
       }
       else
-        read(null, function (end, data) {
-          if(end) cb(end)
-          else if(aborted) cb(aborted)
-          else {
-            busy = true
-            map(data, function (err, data) {
-              busy = false
-              if(aborted) {
-                cb(aborted)
-                abortCb && abortCb(aborted)
-              }
-              else if(err) next (err, cb)
-              else cb(null, data)
-            })
-          }
-        })
+        read(null, function (end, data) {})
     }
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:28:14
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(true) cb(end)
           else if(aborted) cb(aborted)
           else {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] ConditionalExpression
throughs/async-map.js:28:14
       }
       else
         read(null, function (end, data) {
-          if(end) cb(end)
+          if(false) cb(end)
           else if(aborted) cb(aborted)
           else {

[Killed] ConditionalExpression
throughs/async-map.js:29:19
       else
         read(null, function (end, data) {
           if(end) cb(end)
-          else if(aborted) cb(aborted)
+          else if(true) cb(aborted)
           else {
             busy = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:29:19
       else
         read(null, function (end, data) {
           if(end) cb(end)
-          else if(aborted) cb(aborted)
+          else if(false) cb(aborted)
           else {
             busy = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/async-map.js:30:16
         read(null, function (end, data) {
           if(end) cb(end)
           else if(aborted) cb(aborted)
-          else {
-            busy = true
-            map(data, function (err, data) {
-              busy = false
-              if(aborted) {
-                cb(aborted)
-                abortCb && abortCb(aborted)
-              }
-              else if(err) next (err, cb)
-              else cb(null, data)
-            })
-          }
+          else {}
         })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/async-map.js:31:20
           if(end) cb(end)
           else if(aborted) cb(aborted)
           else {
-            busy = true
+            busy = false
             map(data, function (err, data) {
               busy = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/async-map.js:32:44
           else if(aborted) cb(aborted)
           else {
             busy = true
-            map(data, function (err, data) {
-              busy = false
-              if(aborted) {
-                cb(aborted)
-                abortCb && abortCb(aborted)
-              }
-              else if(err) next (err, cb)
-              else cb(null, data)
-            })
+            map(data, function (err, data) {})
           }
         })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/async-map.js:33:22
           else {
             busy = true
             map(data, function (err, data) {
-              busy = false
+              busy = true
               if(aborted) {
                 cb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:34:18
             busy = true
             map(data, function (err, data) {
               busy = false
-              if(aborted) {
+              if(false) {
                 cb(aborted)
                 abortCb && abortCb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:34:18
             busy = true
             map(data, function (err, data) {
               busy = false
-              if(aborted) {
+              if(true) {
                 cb(aborted)
                 abortCb && abortCb(aborted)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:36:17
               busy = false
               if(aborted) {
                 cb(aborted)
-                abortCb && abortCb(aborted)
+                true
               }
               else if(err) next (err, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
throughs/async-map.js:36:17
               busy = false
               if(aborted) {
                 cb(aborted)
-                abortCb && abortCb(aborted)
+                abortCb || abortCb(aborted)
               }
               else if(err) next (err, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/async-map.js:38:23
                 cb(aborted)
                 abortCb && abortCb(aborted)
               }
-              else if(err) next (err, cb)
+              else if(false) next (err, cb)
               else cb(null, data)
             })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
