[Killed] BlockStatement
throughs/filter-not.js:6:44
 var tester = require('../util/tester')
 var filter = require('./filter')
 
-module.exports = function filterNot (test) {
-  test = tester(test)
-  return filter(function (data) { return !test(data) })
-}
+module.exports = function filterNot (test) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/filter-not.js:8:42
 
 module.exports = function filterNot (test) {
   test = tester(test)
-  return filter(function (data) { return !test(data) })
+  return filter(function (data) { return test(data) })
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] BlockStatement
throughs/filter-not.js:8:33
 
 module.exports = function filterNot (test) {
   test = tester(test)
-  return filter(function (data) { return !test(data) })
+  return filter(function (data) {})
 }
 
