[Killed] BlockStatement
throughs/filter.js:5:41
 
 var tester = require('../util/tester')
 
-module.exports = function filter (test) {
-  //regexp
-  test = tester(test)
-  return function (read) {
-    return function next (end, cb) {
-      var sync, loop = true
-      while(loop) {
-        loop = false
-        sync = true
-        read(end, function (end, data) {
-          if(!end && !test(data))
-            return sync ? loop = true : next(end, cb)
-          cb(end, data)
-        })
-        sync = false
-      }
-    }
-  }
-}
+module.exports = function filter (test) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/filter.js:8:26
 module.exports = function filter (test) {
   //regexp
   test = tester(test)
-  return function (read) {
-    return function next (end, cb) {
-      var sync, loop = true
-      while(loop) {
-        loop = false
-        sync = true
-        read(end, function (end, data) {
-          if(!end && !test(data))
-            return sync ? loop = true : next(end, cb)
-          cb(end, data)
-        })
-        sync = false
-      }
-    }
-  }
+  return function (read) {}
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/filter.js:9:36
   //regexp
   test = tester(test)
   return function (read) {
-    return function next (end, cb) {
-      var sync, loop = true
-      while(loop) {
-        loop = false
-        sync = true
-        read(end, function (end, data) {
-          if(!end && !test(data))
-            return sync ? loop = true : next(end, cb)
-          cb(end, data)
-        })
-        sync = false
-      }
-    }
+    return function next (end, cb) {}
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/filter.js:10:24
   test = tester(test)
   return function (read) {
     return function next (end, cb) {
-      var sync, loop = true
+      var sync, loop = false
       while(loop) {
         loop = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/filter.js:11:13
   return function (read) {
     return function next (end, cb) {
       var sync, loop = true
-      while(loop) {
+      while(false) {
         loop = false
         sync = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] BlockStatement
throughs/filter.js:11:19
   return function (read) {
     return function next (end, cb) {
       var sync, loop = true
-      while(loop) {
-        loop = false
-        sync = true
-        read(end, function (end, data) {
-          if(!end && !test(data))
-            return sync ? loop = true : next(end, cb)
-          cb(end, data)
-        })
-        sync = false
-      }
+      while(loop) {}
     }
   }

[Timeout] BooleanLiteral
throughs/filter.js:12:16
     return function next (end, cb) {
       var sync, loop = true
       while(loop) {
-        loop = false
+        loop = true
         sync = true
         read(end, function (end, data) {

[Survived] BooleanLiteral
throughs/filter.js:13:16
       var sync, loop = true
       while(loop) {
         loop = false
-        sync = true
+        sync = false
         read(end, function (end, data) {
           if(!end && !test(data))

[Killed] BlockStatement
throughs/filter.js:14:40
       while(loop) {
         loop = false
         sync = true
-        read(end, function (end, data) {
-          if(!end && !test(data))
-            return sync ? loop = true : next(end, cb)
-          cb(end, data)
-        })
+        read(end, function (end, data) {})
         sync = false
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/filter.js:15:14
         loop = false
         sync = true
         read(end, function (end, data) {
-          if(!end && !test(data))
+          if(false)
             return sync ? loop = true : next(end, cb)
           cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/filter.js:15:22
         loop = false
         sync = true
         read(end, function (end, data) {
-          if(!end && !test(data))
+          if(!end && test(data))
             return sync ? loop = true : next(end, cb)
           cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/filter.js:16:34
         sync = true
         read(end, function (end, data) {
           if(!end && !test(data))
-            return sync ? loop = true : next(end, cb)
+            return sync ? loop = false : next(end, cb)
           cb(end, data)
         })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] BooleanLiteral
throughs/filter.js:19:16
             return sync ? loop = true : next(end, cb)
           cb(end, data)
         })
-        sync = false
+        sync = true
       }
     }
