[Killed] BlockStatement
throughs/flatten.js:11:18
   return function (read) {
     var _read
     return function (abort, cb) {
-      if (abort) { //abort the current stream, and then stream of streams.
-        _read ? _read(abort, function(err) {
-          read(err || abort, cb)
-        }) : read(abort, cb)
-      }
+      if (abort) {}
       else if(_read) nextChunk()
       else nextStream()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/flatten.js:11:11
   return function (read) {
     var _read
     return function (abort, cb) {
-      if (abort) { //abort the current stream, and then stream of streams.
+      if (false) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
           read(err || abort, cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/flatten.js:12:44
     var _read
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
-        _read ? _read(abort, function(err) {
-          read(err || abort, cb)
-        }) : read(abort, cb)
+        _read ? _read(abort, function(err) {}) : read(abort, cb)
       }
       else if(_read) nextChunk()
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/flatten.js:13:16
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          read(false, cb)
         }) : read(abort, cb)
       }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] LogicalOperator
throughs/flatten.js:13:16
     return function (abort, cb) {
       if (abort) { //abort the current stream, and then stream of streams.
         _read ? _read(abort, function(err) {
-          read(err || abort, cb)
+          read(err && abort, cb)
         }) : read(abort, cb)
       }

[Killed] ConditionalExpression
throughs/flatten.js:16:15
           read(err || abort, cb)
         }) : read(abort, cb)
       }
-      else if(_read) nextChunk()
+      else if(false) nextChunk()
       else nextStream()
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/flatten.js:16:15
           read(err || abort, cb)
         }) : read(abort, cb)
       }
-      else if(_read) nextChunk()
+      else if(true) nextChunk()
       else nextStream()
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/flatten.js:19:29
       else if(_read) nextChunk()
       else nextStream()
 
-      function nextChunk () {
-        _read(null, function (err, data) {
-          if (err) {
-            if (err === true) nextStream()
-            else read(true, function(abortErr) {
-              // TODO: what do we do with the abortErr?
-              cb(err)
-            })
-          }
-          else cb(null, data)
-        })
-      }
+      function nextChunk () {}
       function nextStream () {
         _read = null
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/flatten.js:20:42
       else nextStream()
 
       function nextChunk () {
-        _read(null, function (err, data) {
-          if (err) {
-            if (err === true) nextStream()
-            else read(true, function(abortErr) {
-              // TODO: what do we do with the abortErr?
-              cb(err)
-            })
-          }
-          else cb(null, data)
-        })
+        _read(null, function (err, data) {})
       }
       function nextStream () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/flatten.js:21:15
 
       function nextChunk () {
         _read(null, function (err, data) {
-          if (err) {
+          if (true) {
             if (err === true) nextStream()
             else read(true, function(abortErr) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/flatten.js:21:20
 
       function nextChunk () {
         _read(null, function (err, data) {
-          if (err) {
-            if (err === true) nextStream()
-            else read(true, function(abortErr) {
-              // TODO: what do we do with the abortErr?
-              cb(err)
-            })
-          }
+          if (err) {}
           else cb(null, data)
         })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/flatten.js:22:17
       function nextChunk () {
         _read(null, function (err, data) {
           if (err) {
-            if (err === true) nextStream()
+            if (false) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/flatten.js:22:25
       function nextChunk () {
         _read(null, function (err, data) {
           if (err) {
-            if (err === true) nextStream()
+            if (err === false) nextStream()
             else read(true, function(abortErr) {
               // TODO: what do we do with the abortErr?
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/flatten.js:23:23
         _read(null, function (err, data) {
           if (err) {
             if (err === true) nextStream()
-            else read(true, function(abortErr) {
+            else read(false, function(abortErr) {
               // TODO: what do we do with the abortErr?
               cb(err)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/flatten.js:23:48
         _read(null, function (err, data) {
           if (err) {
             if (err === true) nextStream()
-            else read(true, function(abortErr) {
-              // TODO: what do we do with the abortErr?
-              cb(err)
-            })
+            else read(true, function(abortErr) {})
           }
           else cb(null, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/flatten.js:31:30
           else cb(null, data)
         })
       }
-      function nextStream () {
-        _read = null
-        read(null, function (end, stream) {
-          if(end)
-            return cb(end)
-          if(stream && 'object' === typeof stream)
-            stream = values(stream)
-          else if ('function' !== typeof stream)
-            stream = once(stream)
-          _read = stream
-          nextChunk()
-        })
-      }
+      function nextStream () {}
     }
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/flatten.js:33:43
       }
       function nextStream () {
         _read = null
-        read(null, function (end, stream) {
-          if(end)
-            return cb(end)
-          if(stream && 'object' === typeof stream)
-            stream = values(stream)
-          else if ('function' !== typeof stream)
-            stream = once(stream)
-          _read = stream
-          nextChunk()
-        })
+        read(null, function (end, stream) {})
       }
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/flatten.js:34:14
       function nextStream () {
         _read = null
         read(null, function (end, stream) {
-          if(end)
+          if(true)
             return cb(end)
           if(stream && 'object' === typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] EqualityOperator
throughs/flatten.js:36:24
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(stream && 'object' !== typeof stream)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/flatten.js:36:14
         read(null, function (end, stream) {
           if(end)
             return cb(end)
-          if(stream && 'object' === typeof stream)
+          if(true)
             stream = values(stream)
           else if ('function' !== typeof stream)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] EqualityOperator
throughs/flatten.js:38:20
             return cb(end)
           if(stream && 'object' === typeof stream)
             stream = values(stream)
-          else if ('function' !== typeof stream)
+          else if ('function' === typeof stream)
             stream = once(stream)
           _read = stream
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
