[Killed] BlockStatement
throughs/non-unique.js:6:45
 var unique = require('./unique')
 
 //passes an item through when you see it for the second time.
-module.exports = function nonUnique (field) {
-  return unique(field, true)
-}
+module.exports = function nonUnique (field) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
