[Killed] ConditionalExpression
throughs/take.js:5:10
 
 //read a number of items and then stop.
 module.exports = function take (test, opts) {
-  opts = opts || {}
+  opts = true
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/take.js:5:10
 
 //read a number of items and then stop.
 module.exports = function take (test, opts) {
-  opts = opts || {}
+  opts = false
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/take.js:6:27
 //read a number of items and then stop.
 module.exports = function take (test, opts) {
   opts = opts || {}
-  var last = opts.last || false // whether the first item for which !test(item) should still pass
+  var last = opts.last || true // whether the first item for which !test(item) should still pass
   var ended = false
   if('number' === typeof test) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
throughs/take.js:6:14
 //read a number of items and then stop.
 module.exports = function take (test, opts) {
   opts = opts || {}
-  var last = opts.last || false // whether the first item for which !test(item) should still pass
+  var last = opts.last && false // whether the first item for which !test(item) should still pass
   var ended = false
   if('number' === typeof test) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/take.js:7:15
 module.exports = function take (test, opts) {
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
-  var ended = false
+  var ended = true
   if('number' === typeof test) {
     last = true
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] EqualityOperator
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if('number' !== typeof test) {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/take.js:8:6
   opts = opts || {}
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
-  if('number' === typeof test) {
+  if(true) {
     last = true
     var n = test; test = function () {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/take.js:9:12
   var last = opts.last || false // whether the first item for which !test(item) should still pass
   var ended = false
   if('number' === typeof test) {
-    last = true
+    last = false
     var n = test; test = function () {
       return --n
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/take.js:10:38
   var ended = false
   if('number' === typeof test) {
     last = true
-    var n = test; test = function () {
-      return --n
-    }
+    var n = test; test = function () {}
   }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] UpdateOperator
throughs/take.js:11:14
   if('number' === typeof test) {
     last = true
     var n = test; test = function () {
-      return --n
+      return ++n
     }
   }

[Killed] BlockStatement
throughs/take.js:17:29
 
   return function (read) {
 
-    function terminate (cb) {
-      read(true, function (err) {
-        last = false; cb(err || true)
-      })
-    }
+    function terminate (cb) {}
 
     return function (end, cb) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/take.js:18:33
   return function (read) {
 
     function terminate (cb) {
-      read(true, function (err) {
-        last = false; cb(err || true)
-      })
+      read(true, function (err) {})
     }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/take.js:18:12
   return function (read) {
 
     function terminate (cb) {
-      read(true, function (err) {
+      read(false, function (err) {
         last = false; cb(err || true)
       })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/take.js:19:26
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; cb(false)
       })
     }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] ConditionalExpression
throughs/take.js:19:26
 
     function terminate (cb) {
       read(true, function (err) {
-        last = false; cb(err || true)
+        last = false; cb(true)
       })
     }

[Killed] BlockStatement
throughs/take.js:23:31
       })
     }
 
-    return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
-      else if(ended = end) read(ended, cb)
-      else
-        read(null, function (end, data) {
-          if(ended = ended || end) {
-            //last ? terminate(cb) :
-            cb(ended)
-          }
-          else if(!test(data)) {
-            ended = true
-            last ? cb(null, data) : terminate(cb)
-          }
-          else
-            cb(null, data)
-        })
-    }
+    return function (end, cb) {}
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] LogicalOperator
throughs/take.js:24:10
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended || !end) last ? terminate(cb) : cb(ended)
       else if(ended = end) read(ended, cb)
       else

[Timeout] BooleanLiteral
throughs/take.js:24:19
     }
 
     return function (end, cb) {
-      if(ended && !end) last ? terminate(cb) : cb(ended)
+      if(ended && end) last ? terminate(cb) : cb(ended)
       else if(ended = end) read(ended, cb)
       else

[Killed] ConditionalExpression
throughs/take.js:25:15
 
     return function (end, cb) {
       if(ended && !end) last ? terminate(cb) : cb(ended)
-      else if(ended = end) read(ended, cb)
+      else if(false) read(ended, cb)
       else
         read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/take.js:25:15
 
     return function (end, cb) {
       if(ended && !end) last ? terminate(cb) : cb(ended)
-      else if(ended = end) read(ended, cb)
+      else if(true) read(ended, cb)
       else
         read(null, function (end, data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/take.js:27:41
       if(ended && !end) last ? terminate(cb) : cb(ended)
       else if(ended = end) read(ended, cb)
       else
-        read(null, function (end, data) {
-          if(ended = ended || end) {
-            //last ? terminate(cb) :
-            cb(ended)
-          }
-          else if(!test(data)) {
-            ended = true
-            last ? cb(null, data) : terminate(cb)
-          }
-          else
-            cb(null, data)
-        })
+        read(null, function (end, data) {})
     }
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/take.js:28:14
       else if(ended = end) read(ended, cb)
       else
         read(null, function (end, data) {
-          if(ended = ended || end) {
+          if(false) {
             //last ? terminate(cb) :
             cb(ended)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/take.js:28:14
       else if(ended = end) read(ended, cb)
       else
         read(null, function (end, data) {
-          if(ended = ended || end) {
+          if(true) {
             //last ? terminate(cb) :
             cb(ended)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/take.js:32:19
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
+          else if(true) {
             ended = true
             last ? cb(null, data) : terminate(cb)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/take.js:32:32
             //last ? terminate(cb) :
             cb(ended)
           }
-          else if(!test(data)) {
-            ended = true
-            last ? cb(null, data) : terminate(cb)
-          }
+          else if(!test(data)) {}
           else
             cb(null, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Timeout] BooleanLiteral
throughs/take.js:33:21
             cb(ended)
           }
           else if(!test(data)) {
-            ended = true
+            ended = false
             last ? cb(null, data) : terminate(cb)
           }
