[Killed] BlockStatement
throughs/through.js:4:47
 'use strict'
 
 //a pass through stream that doesn't change the value.
-module.exports = function through (op, onEnd) {
-  var a = false
-
-  function once (abort) {
-    if(a || !onEnd) return
-    a = true
-    onEnd(abort === true ? null : abort)
-  }
-
-  return function (read) {
-    return function (end, cb) {
-      if(end) once(end)
-      return read(end, function (end, data) {
-        if(!end) op && op(data)
-        else once(end)
-        cb(end, data)
-      })
-    }
-  }
-}
+module.exports = function through (op, onEnd) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/through.js:5:11
 
 //a pass through stream that doesn't change the value.
 module.exports = function through (op, onEnd) {
-  var a = false
+  var a = true
 
   function once (abort) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/through.js:7:25
 module.exports = function through (op, onEnd) {
   var a = false
 
-  function once (abort) {
-    if(a || !onEnd) return
-    a = true
-    onEnd(abort === true ? null : abort)
-  }
+  function once (abort) {}
 
   return function (read) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/through.js:8:8
   var a = false
 
   function once (abort) {
-    if(a || !onEnd) return
+    if(false) return
     a = true
     onEnd(abort === true ? null : abort)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/through.js:9:9
 
   function once (abort) {
     if(a || !onEnd) return
-    a = true
+    a = false
     onEnd(abort === true ? null : abort)
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] EqualityOperator
throughs/through.js:10:11
   function once (abort) {
     if(a || !onEnd) return
     a = true
-    onEnd(abort === true ? null : abort)
+    onEnd(abort !== true ? null : abort)
   }
 

[Killed] BlockStatement
throughs/through.js:13:26
     onEnd(abort === true ? null : abort)
   }
 
-  return function (read) {
-    return function (end, cb) {
-      if(end) once(end)
-      return read(end, function (end, data) {
-        if(!end) op && op(data)
-        else once(end)
-        cb(end, data)
-      })
-    }
-  }
+  return function (read) {}
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec


/Users/ANON/Documents/research/LLMTestGeneration/subject_repositories/pull-stream/.stryker-tmp/sandbox-QqyRWC/test/abort-stalled.js:28
      read(abort, cb)
      ^

[Killed] BlockStatement
throughs/through.js:14:31
   }
 
   return function (read) {
-    return function (end, cb) {
-      if(end) once(end)
-      return read(end, function (end, data) {
-        if(!end) op && op(data)
-        else once(end)
-        cb(end, data)
-      })
-    }
+    return function (end, cb) {}
   }
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] ConditionalExpression
throughs/through.js:15:10
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(true) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Survived] ConditionalExpression
throughs/through.js:15:10
 
   return function (read) {
     return function (end, cb) {
-      if(end) once(end)
+      if(false) once(end)
       return read(end, function (end, data) {
         if(!end) op && op(data)

[Killed] BlockStatement
throughs/through.js:16:45
   return function (read) {
     return function (end, cb) {
       if(end) once(end)
-      return read(end, function (end, data) {
-        if(!end) op && op(data)
-        else once(end)
-        cb(end, data)
-      })
+      return read(end, function (end, data) {})
     }
   }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/through.js:17:18
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(!end) true
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/through.js:17:18
     return function (end, cb) {
       if(end) once(end)
       return read(end, function (end, data) {
-        if(!end) op && op(data)
+        if(!end) false
         else once(end)
         cb(end, data)
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
