[Killed] BlockStatement
throughs/unique.js:8:50
 var filter = require('./filter')
 
 //drop items you have already seen.
-module.exports = function unique (field, invert) {
-  field = prop(field) || id
-  var seen = {}
-  return filter(function (data) {
-    var key = field(data)
-    if(seen[key]) return !!invert //false, by default
-    else seen[key] = true
-    return !invert //true by default
-  })
-}
+module.exports = function unique (field, invert) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
throughs/unique.js:9:11
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = prop(field) && id
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/unique.js:9:11
 
 //drop items you have already seen.
 module.exports = function unique (field, invert) {
-  field = prop(field) || id
+  field = true
   var seen = {}
   return filter(function (data) {
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BlockStatement
throughs/unique.js:11:33
 module.exports = function unique (field, invert) {
   field = prop(field) || id
   var seen = {}
-  return filter(function (data) {
-    var key = field(data)
-    if(seen[key]) return !!invert //false, by default
-    else seen[key] = true
-    return !invert //true by default
-  })
+  return filter(function (data) {})
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
throughs/unique.js:13:8
   var seen = {}
   return filter(function (data) {
     var key = field(data)
-    if(seen[key]) return !!invert //false, by default
+    if(true) return !!invert //false, by default
     else seen[key] = true
     return !invert //true by default
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/unique.js:13:26
   var seen = {}
   return filter(function (data) {
     var key = field(data)
-    if(seen[key]) return !!invert //false, by default
+    if(seen[key]) return !invert //false, by default
     else seen[key] = true
     return !invert //true by default
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/unique.js:14:22
   return filter(function (data) {
     var key = field(data)
     if(seen[key]) return !!invert //false, by default
-    else seen[key] = true
+    else seen[key] = false
     return !invert //true by default
   })
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] BooleanLiteral
throughs/unique.js:15:12
     var key = field(data)
     if(seen[key]) return !!invert //false, by default
     else seen[key] = true
-    return !invert //true by default
+    return invert //true by default
   })
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
