[Killed] BlockStatement
util/abort-cb.js:1:55
-module.exports = function abortCb(cb, abort, onAbort) {
-  cb(abort)
-  onAbort && onAbort(abort === true ? null: abort)
-  return
-}
+module.exports = function abortCb(cb, abort, onAbort) {}
 
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
util/abort-cb.js:3:22
 module.exports = function abortCb(cb, abort, onAbort) {
   cb(abort)
-  onAbort && onAbort(abort === true ? null: abort)
+  onAbort && onAbort(false ? null: abort)
   return
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
