[Killed] BlockStatement
util/prop.js:1:38
-module.exports = function prop (key) {
-  return key && (
-    'string' == typeof key
-    ? function (data) { return data[key] }
-    : 'object' === typeof key && 'function' === typeof key.exec //regexp
-    ? function (data) { var v = key.exec(data); return v && v[0] }
-    : key
-  )
-}
+module.exports = function prop (key) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
util/prop.js:2:10
 module.exports = function prop (key) {
-  return key && (
-    'string' == typeof key
-    ? function (data) { return data[key] }
-    : 'object' === typeof key && 'function' === typeof key.exec //regexp
-    ? function (data) { var v = key.exec(data); return v && v[0] }
-    : key
-  )
+  return false
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
util/prop.js:2:10
 module.exports = function prop (key) {
-  return key && (
-    'string' == typeof key
-    ? function (data) { return data[key] }
-    : 'object' === typeof key && 'function' === typeof key.exec //regexp
-    ? function (data) { var v = key.exec(data); return v && v[0] }
-    : key
-  )
+  return true
 }
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] EqualityOperator
util/prop.js:3:5
 module.exports = function prop (key) {
   return key && (
-    'string' == typeof key
+    'string' != typeof key
     ? function (data) { return data[key] }
     : 'object' === typeof key && 'function' === typeof key.exec //regexp
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
util/prop.js:3:5
 module.exports = function prop (key) {
   return key && (
-    'string' == typeof key
+    true
     ? function (data) { return data[key] }
     : 'object' === typeof key && 'function' === typeof key.exec //regexp
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] BlockStatement
util/prop.js:4:23
 module.exports = function prop (key) {
   return key && (
     'string' == typeof key
-    ? function (data) { return data[key] }
+    ? function (data) {}
     : 'object' === typeof key && 'function' === typeof key.exec //regexp
     ? function (data) { var v = key.exec(data); return v && v[0] }

[Killed] ConditionalExpression
util/prop.js:5:7
   return key && (
     'string' == typeof key
     ? function (data) { return data[key] }
-    : 'object' === typeof key && 'function' === typeof key.exec //regexp
+    : true //regexp
     ? function (data) { var v = key.exec(data); return v && v[0] }
     : key
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] EqualityOperator
util/prop.js:5:34
   return key && (
     'string' == typeof key
     ? function (data) { return data[key] }
-    : 'object' === typeof key && 'function' === typeof key.exec //regexp
+    : 'object' === typeof key && 'function' !== typeof key.exec //regexp
     ? function (data) { var v = key.exec(data); return v && v[0] }
     : key

[Survived] LogicalOperator
util/prop.js:6:56
     'string' == typeof key
     ? function (data) { return data[key] }
     : 'object' === typeof key && 'function' === typeof key.exec //regexp
-    ? function (data) { var v = key.exec(data); return v && v[0] }
+    ? function (data) { var v = key.exec(data); return v || v[0] }
     : key
   )

[Survived] ConditionalExpression
util/prop.js:6:56
     'string' == typeof key
     ? function (data) { return data[key] }
     : 'object' === typeof key && 'function' === typeof key.exec //regexp
-    ? function (data) { var v = key.exec(data); return v && v[0] }
+    ? function (data) { var v = key.exec(data); return true }
     : key
   )
