[Killed] BlockStatement
util/tester.js:5:41
 
 function id (e) { return e }
 
-module.exports = function tester (test) {
-  return (
-    'object' === typeof test && 'function' === typeof test.test //regexp
-    ? function (data) { return test.test(data) }
-    : prop (test) || id
-  )
-}
+module.exports = function tester (test) {}
 
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] ConditionalExpression
util/tester.js:7:5
 
 module.exports = function tester (test) {
   return (
-    'object' === typeof test && 'function' === typeof test.test //regexp
+    true //regexp
     ? function (data) { return test.test(data) }
     : prop (test) || id
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Survived] EqualityOperator
util/tester.js:7:5
 
 module.exports = function tester (test) {
   return (
-    'object' === typeof test && 'function' === typeof test.test //regexp
+    'object' !== typeof test && 'function' === typeof test.test //regexp
     ? function (data) { return test.test(data) }
     : prop (test) || id

[Timeout] BlockStatement
util/tester.js:8:23
 module.exports = function tester (test) {
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
-    ? function (data) { return test.test(data) }
+    ? function (data) {}
     : prop (test) || id
   )

[Killed] ConditionalExpression
util/tester.js:9:7
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
     ? function (data) { return test.test(data) }
-    : prop (test) || id
+    : false
   )
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through

[Killed] LogicalOperator
util/tester.js:9:7
   return (
     'object' === typeof test && 'function' === typeof test.test //regexp
     ? function (data) { return test.test(data) }
-    : prop (test) || id
+    : prop(test) && id
   )
 }
killedBy: All tests
statusReason: > pull-stream@3.6.14 test
> tape test/*.js | tap-bail | tap-spec



  test abort:through
