[Killed] ConditionalExpression
src/matcher.ts:12:9
   /** @param spec Path specification.
     * @param version Specification language version. */
   constructor (spec: string, version: '1' | '1.0' | '1.1' = '1.1') {
-    if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
+    if (false) {
       throw new Error('Path contains invalid characters')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


PASS test/rule.ts

  rule

[Killed] BlockStatement
src/matcher.ts:12:57
   /** @param spec Path specification.
     * @param version Specification language version. */
   constructor (spec: string, version: '1' | '1.0' | '1.1' = '1.1') {
-    if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
-      throw new Error('Path contains invalid characters')
-    }
+    if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {}
     if (spec.match(/^\//) === null) {
       throw new Error('Path must begin with a slash')
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher
    ✓ accepts valid paths (2 ms)

[Killed] ConditionalExpression
src/matcher.ts:15:9
     if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
       throw new Error('Path contains invalid characters')
     }
-    if (spec.match(/^\//) === null) {
+    if (true) {
       throw new Error('Path must begin with a slash')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap
    ✕ matches queries correctly (1 ms)

[Killed] EqualityOperator
src/matcher.ts:15:9
     if (spec.match(/^[a-zA-Z0-9_/:~.$+*-]*$/) === null) {
       throw new Error('Path contains invalid characters')
     }
-    if (spec.match(/^\//) === null) {
+    if (spec.match(/^\//) !== null) {
       throw new Error('Path must begin with a slash')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts
  policymap
    ✕ matches queries correctly (3 ms)
    ✕ answers queries correctly (1 ms)

[Killed] ConditionalExpression
src/matcher.ts:18:9
     if (spec.match(/^\//) === null) {
       throw new Error('Path must begin with a slash')
     }
-    if (spec.match(/\/\//) !== null) {
+    if (false) {
       throw new Error('Path contains empty segments')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


PASS test/rule.ts

  rule

[Killed] BlockStatement
src/matcher.ts:18:38
     if (spec.match(/^\//) === null) {
       throw new Error('Path must begin with a slash')
     }
-    if (spec.match(/\/\//) !== null) {
-      throw new Error('Path contains empty segments')
-    }
+    if (spec.match(/\/\//) !== null) {}
     if (spec.match(version === '1' || version === '1.0'
       ? /[*+][^/]|[^/][*+]/
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Survived] StringLiteral
src/matcher.ts:19:23
       throw new Error('Path must begin with a slash')
     }
     if (spec.match(/\/\//) !== null) {
-      throw new Error('Path contains empty segments')
+      throw new Error("")
     }
     if (spec.match(version === '1' || version === '1.0'

[Killed] EqualityOperator
src/matcher.ts:21:9
     if (spec.match(/\/\//) !== null) {
       throw new Error('Path contains empty segments')
     }
-    if (spec.match(version === '1' || version === '1.0'
-      ? /[*+][^/]|[^/][*+]/
-      : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
+    if (spec.match(version === '1' || version === '1.0' ? /[*+][^/]|[^/][*+]/ : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) === null) {
       throw new Error('Path contains malformed wildcards')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:21:39
     if (spec.match(/\/\//) !== null) {
       throw new Error('Path contains empty segments')
     }
-    if (spec.match(version === '1' || version === '1.0'
+    if (spec.match(version === '1' || false
       ? /[*+][^/]|[^/][*+]/
       : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Survived] Regex
src/matcher.ts:22:9
       throw new Error('Path contains empty segments')
     }
     if (spec.match(version === '1' || version === '1.0'
-      ? /[*+][^/]|[^/][*+]/
+      ? /[*+][/]|[^/][*+]/
       : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
       throw new Error('Path contains malformed wildcards')

[Survived] Regex
src/matcher.ts:22:9
       throw new Error('Path contains empty segments')
     }
     if (spec.match(version === '1' || version === '1.0'
-      ? /[*+][^/]|[^/][*+]/
+      ? /[^*+][^/]|[^/][*+]/
       : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
       throw new Error('Path contains malformed wildcards')

[Killed] BlockStatement
src/matcher.ts:23:68
     }
     if (spec.match(version === '1' || version === '1.0'
       ? /[*+][^/]|[^/][*+]/
-      : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
-      throw new Error('Path contains malformed wildcards')
-    }
+      : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {}
     if (spec.match(/[^/]:|:\/|:$/) !== null) {
       throw new Error('Path contains malformed captures')
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] Regex
src/matcher.ts:23:9
     }
     if (spec.match(version === '1' || version === '1.0'
       ? /[*+][^/]|[^/][*+]/
-      : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
+      : /\*[^*/]|\+[^+/]|[/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
       throw new Error('Path contains malformed wildcards')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:26:9
       : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
       throw new Error('Path contains malformed wildcards')
     }
-    if (spec.match(/[^/]:|:\/|:$/) !== null) {
+    if (true) {
       throw new Error('Path contains malformed captures')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] EqualityOperator
src/matcher.ts:26:9
       : /\*[^*/]|\+[^+/]|[^/*]\*|[^/+]\+|\*\*\*|\+\+\+/) !== null) {
       throw new Error('Path contains malformed wildcards')
     }
-    if (spec.match(/[^/]:|:\/|:$/) !== null) {
+    if (spec.match(/[^/]:|:\/|:$/) === null) {
       throw new Error('Path contains malformed captures')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Survived] StringLiteral
src/matcher.ts:27:23
       throw new Error('Path contains malformed wildcards')
     }
     if (spec.match(/[^/]:|:\/|:$/) !== null) {
-      throw new Error('Path contains malformed captures')
+      throw new Error("")
     }
     if (spec.match(/^.+\/$/) !== null) {

[Killed] ConditionalExpression
src/matcher.ts:29:9
     if (spec.match(/[^/]:|:\/|:$/) !== null) {
       throw new Error('Path contains malformed captures')
     }
-    if (spec.match(/^.+\/$/) !== null) {
+    if (false) {
       throw new Error('Path must not end with a slash')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] EqualityOperator
src/matcher.ts:29:9
     if (spec.match(/[^/]:|:\/|:$/) !== null) {
       throw new Error('Path contains malformed captures')
     }
-    if (spec.match(/^.+\/$/) !== null) {
+    if (spec.match(/^.+\/$/) === null) {
       throw new Error('Path must not end with a slash')
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Survived] StringLiteral
src/matcher.ts:30:23
       throw new Error('Path contains malformed captures')
     }
     if (spec.match(/^.+\/$/) !== null) {
-      throw new Error('Path must not end with a slash')
+      throw new Error("")
     }
     const { regex, props } = compile(spec)

[Killed] BlockStatement
src/matcher.ts:38:60
     this.props = props
   }
 
-  [Symbol.match] (string: string): RegExpMatchArray | null {
-    if (string.length > 1 && string.endsWith('/')) {
-      return null
-    }
-    return super[Symbol.match](string)
-  }
+  [Symbol.match] (string: string): RegExpMatchArray | null {}
 
   /** Static constructor function; returns a new Matcher.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] MethodExpression
src/matcher.ts:39:30
   }
 
   [Symbol.match] (string: string): RegExpMatchArray | null {
-    if (string.length > 1 && string.endsWith('/')) {
+    if (string.length > 1 && string.startsWith('/')) {
       return null
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] LogicalOperator
src/matcher.ts:39:9
   }
 
   [Symbol.match] (string: string): RegExpMatchArray | null {
-    if (string.length > 1 && string.endsWith('/')) {
+    if (string.length > 1 || string.endsWith('/')) {
       return null
     }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BlockStatement
src/matcher.ts:48:76
   /** Static constructor function; returns a new Matcher.
     * @param spec Path specification.
     * @param version Specification language version. */
-  static for (spec: string, version: '1' | '1.0' | '1.1' = '1.1'): Matcher {
-    return new Matcher(spec, version)
-  }
+  static for (spec: string, version: '1' | '1.0' | '1.1' = '1.1'): Matcher {}
 }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ArrayDeclaration
src/matcher.ts:57:27
   regex: string
   props: string[]
 } {
-  const parts: string[] = []
+  const parts: string[] = ["Stryker was here"]
   const props: string[] = []
   let min = 0
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:61:13
   const props: string[] = []
   let min = 0
   let max = 0
-  let any = false
+  let any = true
   let opt = true
   function flatten (final: boolean = false): void {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:62:13
   let min = 0
   let max = 0
   let any = false
-  let opt = true
+  let opt = false
   function flatten (final: boolean = false): void {
     if (max > 0 || any) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BlockStatement
src/matcher.ts:63:51
   let max = 0
   let any = false
   let opt = true
-  function flatten (final: boolean = false): void {
-    if (max > 0 || any) {
-      if (final && opt && min < 1) {
-        min = 1
-      } else if (min > 0) {
-        opt = false
-      }
-      parts.push(any
-        ? min < 2
-          ? min < 1
-            ? '(?:/[^/]+)*'
-            : '(?:/[^/]+)+'
-          : `(?:/[^/]+){${min},}`
-        : max === 1
-          ? min === 1
-            ? '/[^/]+'
-            : '(?:/[^/]+)?'
-          : min === max
-            ? `(?:/[^/]+){${min}}`
-            : `(?:/[^/]+){${min},${max}}`)
-    }
-    min = 0
-    max = 0
-    any = false
-  }
+  function flatten (final: boolean = false): void {}
   function finalise (): string {
     flatten(true)
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:63:38
   let max = 0
   let any = false
   let opt = true
-  function flatten (final: boolean = false): void {
+  function flatten (final: boolean = true): void {
     if (max > 0 || any) {
       if (final && opt && min < 1) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:64:9
   let any = false
   let opt = true
   function flatten (final: boolean = false): void {
-    if (max > 0 || any) {
+    if (true) {
       if (final && opt && min < 1) {
         min = 1
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] LogicalOperator
src/matcher.ts:64:9
   let any = false
   let opt = true
   function flatten (final: boolean = false): void {
-    if (max > 0 || any) {
+    if (max > 0 && any) {
       if (final && opt && min < 1) {
         min = 1
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] EqualityOperator
src/matcher.ts:65:27
   let opt = true
   function flatten (final: boolean = false): void {
     if (max > 0 || any) {
-      if (final && opt && min < 1) {
+      if (final && opt && min >= 1) {
         min = 1
       } else if (min > 0) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:65:11
   let opt = true
   function flatten (final: boolean = false): void {
     if (max > 0 || any) {
-      if (final && opt && min < 1) {
+      if (true) {
         min = 1
       } else if (min > 0) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:67:18
     if (max > 0 || any) {
       if (final && opt && min < 1) {
         min = 1
-      } else if (min > 0) {
+      } else if (false) {
         opt = false
       }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BlockStatement
src/matcher.ts:67:27
     if (max > 0 || any) {
       if (final && opt && min < 1) {
         min = 1
-      } else if (min > 0) {
-        opt = false
-      }
+      } else if (min > 0) {}
       parts.push(any
         ? min < 2
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:68:15
       if (final && opt && min < 1) {
         min = 1
       } else if (min > 0) {
-        opt = false
+        opt = true
       }
       parts.push(any
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:71:11
         opt = false
       }
       parts.push(any
-        ? min < 2
+        ? true
           ? min < 1
             ? '(?:/[^/]+)*'
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] EqualityOperator
src/matcher.ts:71:11
         opt = false
       }
       parts.push(any
-        ? min < 2
+        ? min >= 2
           ? min < 1
             ? '(?:/[^/]+)*'
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:72:13
       }
       parts.push(any
         ? min < 2
-          ? min < 1
+          ? false
             ? '(?:/[^/]+)*'
             : '(?:/[^/]+)+'
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] EqualityOperator
src/matcher.ts:72:13
       }
       parts.push(any
         ? min < 2
-          ? min < 1
+          ? min <= 1
             ? '(?:/[^/]+)*'
             : '(?:/[^/]+)+'
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] StringLiteral
src/matcher.ts:73:15
       parts.push(any
         ? min < 2
           ? min < 1
-            ? '(?:/[^/]+)*'
+            ? ""
             : '(?:/[^/]+)+'
           : `(?:/[^/]+){${min},}`
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] StringLiteral
src/matcher.ts:74:15
         ? min < 2
           ? min < 1
             ? '(?:/[^/]+)*'
-            : '(?:/[^/]+)+'
+            : ""
           : `(?:/[^/]+){${min},}`
         : max === 1
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] StringLiteral
src/matcher.ts:75:13
           ? min < 1
             ? '(?:/[^/]+)*'
             : '(?:/[^/]+)+'
-          : `(?:/[^/]+){${min},}`
+          : ``
         : max === 1
           ? min === 1
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:76:11
             ? '(?:/[^/]+)*'
             : '(?:/[^/]+)+'
           : `(?:/[^/]+){${min},}`
-        : max === 1
+        : false
           ? min === 1
             ? '/[^/]+'
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] EqualityOperator
src/matcher.ts:76:11
             ? '(?:/[^/]+)*'
             : '(?:/[^/]+)+'
           : `(?:/[^/]+){${min},}`
-        : max === 1
+        : max !== 1
           ? min === 1
             ? '/[^/]+'
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] EqualityOperator
src/matcher.ts:77:13
             : '(?:/[^/]+)+'
           : `(?:/[^/]+){${min},}`
         : max === 1
-          ? min === 1
+          ? min !== 1
             ? '/[^/]+'
             : '(?:/[^/]+)?'
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:77:13
             : '(?:/[^/]+)+'
           : `(?:/[^/]+){${min},}`
         : max === 1
-          ? min === 1
+          ? false
             ? '/[^/]+'
             : '(?:/[^/]+)?'
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:80:13
           ? min === 1
             ? '/[^/]+'
             : '(?:/[^/]+)?'
-          : min === max
+          : false
             ? `(?:/[^/]+){${min}}`
             : `(?:/[^/]+){${min},${max}}`)
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:80:13
           ? min === 1
             ? '/[^/]+'
             : '(?:/[^/]+)?'
-          : min === max
+          : true
             ? `(?:/[^/]+){${min}}`
             : `(?:/[^/]+){${min},${max}}`)
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] StringLiteral
src/matcher.ts:82:15
             : '(?:/[^/]+)?'
           : min === max
             ? `(?:/[^/]+){${min}}`
-            : `(?:/[^/]+){${min},${max}}`)
+            : ``)
     }
     min = 0
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:86:11
     }
     min = 0
     max = 0
-    any = false
+    any = true
   }
   function finalise (): string {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BlockStatement
src/matcher.ts:88:32
     max = 0
     any = false
   }
-  function finalise (): string {
-    flatten(true)
-    return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
-  }
+  function finalise (): string {}
   for (const part of spec.split('/').slice(1).reverse()) {
     switch (part) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:89:13
     any = false
   }
   function finalise (): string {
-    flatten(true)
+    flatten(false)
     return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ArrowFunction
src/matcher.ts:90:49
   }
   function finalise (): string {
     flatten(true)
-    return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
+    return (opt ? '^/$|^' : '^') + parts.reduce(() => undefined, '$')
   }
   for (const part of spec.split('/').slice(1).reverse()) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ArithmeticOperator
src/matcher.ts:90:12
   }
   function finalise (): string {
     flatten(true)
-    return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
+    return (opt ? '^/$|^' : '^') - parts.reduce((acc, seg) => seg + acc, '$')
   }
   for (const part of spec.split('/').slice(1).reverse()) {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] MethodExpression
src/matcher.ts:92:22
     flatten(true)
     return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
   }
-  for (const part of spec.split('/').slice(1).reverse()) {
+  for (const part of spec.split('/').slice(1)) {
     switch (part) {
       case '+':
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] MethodExpression
src/matcher.ts:92:22
     flatten(true)
     return (opt ? '^/$|^' : '^') + parts.reduce((acc, seg) => seg + acc, '$')
   }
-  for (const part of spec.split('/').slice(1).reverse()) {
+  for (const part of spec.split('/').reverse()) {
     switch (part) {
       case '+':
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:94:7
   }
   for (const part of spec.split('/').slice(1).reverse()) {
     switch (part) {
-      case '+':
-        min++
-        max++
-        break
+      case '+':
       case '++':
         max++
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] UpdateOperator
src/matcher.ts:95:9
   for (const part of spec.split('/').slice(1).reverse()) {
     switch (part) {
       case '+':
-        min++
+        min--
         max++
         break
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] UpdateOperator
src/matcher.ts:96:9
     switch (part) {
       case '+':
         min++
-        max++
+        max--
         break
       case '++':
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:98:7
         min++
         max++
         break
-      case '++':
-        max++
-        break
+      case '++':
       case '*':
         min++
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] StringLiteral
src/matcher.ts:98:12
         min++
         max++
         break
-      case '++':
+      case "":
         max++
         break
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] UpdateOperator
src/matcher.ts:99:9
         max++
         break
       case '++':
-        max++
+        max--
         break
       case '*':
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:101:7
       case '++':
         max++
         break
-      case '*':
-        min++
-        any = true
-        break
+      case '*':
       case '**':
         any = true
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] UpdateOperator
src/matcher.ts:102:9
         max++
         break
       case '*':
-        min++
+        min--
         any = true
         break
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:103:15
         break
       case '*':
         min++
-        any = true
+        any = false
         break
       case '**':
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:105:7
         min++
         any = true
         break
-      case '**':
-        any = true
-        break
+      case '**':
       default:
         flatten()
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:106:15
         any = true
         break
       case '**':
-        any = true
+        any = false
         break
       default:
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:108:7
       case '**':
         any = true
         break
-      default:
-        flatten()
-        opt = false
-        if (part.match(/:.+/) !== null) {
-          props.push(part.slice(1))
-          parts.push('/([^/]+)')
-        } else {
-          parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
-        }
+      default:
     }
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BooleanLiteral
src/matcher.ts:110:15
         break
       default:
         flatten()
-        opt = false
+        opt = true
         if (part.match(/:.+/) !== null) {
           props.push(part.slice(1))
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] EqualityOperator
src/matcher.ts:111:13
       default:
         flatten()
         opt = false
-        if (part.match(/:.+/) !== null) {
+        if (part.match(/:.+/) === null) {
           props.push(part.slice(1))
           parts.push('/([^/]+)')
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] ConditionalExpression
src/matcher.ts:111:13
       default:
         flatten()
         opt = false
-        if (part.match(/:.+/) !== null) {
+        if (false) {
           props.push(part.slice(1))
           parts.push('/([^/]+)')
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] MethodExpression
src/matcher.ts:112:22
         flatten()
         opt = false
         if (part.match(/:.+/) !== null) {
-          props.push(part.slice(1))
+          props.push(part)
           parts.push('/([^/]+)')
         } else {
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] StringLiteral
src/matcher.ts:113:22
         opt = false
         if (part.match(/:.+/) !== null) {
           props.push(part.slice(1))
-          parts.push('/([^/]+)')
+          parts.push("")
         } else {
           parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] BlockStatement
src/matcher.ts:114:16
         if (part.match(/:.+/) !== null) {
           props.push(part.slice(1))
           parts.push('/([^/]+)')
-        } else {
-          parts.push(`/${part.replace(/([.$])/g, '\\$1')}`)
-        }
+        } else {}
     }
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher

[Killed] MethodExpression
src/matcher.ts:121:12
   }
   return {
     regex: finalise(),
-    props: props.reverse()
+    props: props
   }
 }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/matcher.ts

  matcher
