[Killed] BlockStatement
src/policymap.ts:6:39
 
 /** Queryable collection of policy documents. */
 export class PolicyMap extends Map<string, Policy> implements QueryableMap {
-  constructor (...policies: Policy[]) {
-    super(policies.map((policy) => [policy.name, policy]))
-  }
+  constructor (...policies: Policy[]) {}
 
   /** Add policies to colllection. */
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


PASS test/policy.ts

  policy

[Killed] ArrowFunction
src/policymap.ts:7:24
 /** Queryable collection of policy documents. */
 export class PolicyMap extends Map<string, Policy> implements QueryableMap {
   constructor (...policies: Policy[]) {
-    super(policies.map((policy) => [policy.name, policy]))
+    super(policies.map(() => undefined))
   }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BlockStatement
src/policymap.ts:11:38
   }
 
   /** Add policies to colllection. */
-  push (...policies: Policy[]): this {
-    for (const policy of policies) {
-      this.set(policy.name, policy)
-    }
-    return this
-  }
+  push (...policies: Policy[]): this {}
 
   /** Check whether an action is allowed on a path.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BlockStatement
src/policymap.ts:12:36
 
   /** Add policies to colllection. */
   push (...policies: Policy[]): this {
-    for (const policy of policies) {
-      this.set(policy.name, policy)
-    }
+    for (const policy of policies) {}
     return this
   }
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BlockStatement
src/policymap.ts:27:88
     *          `false` if the action is explicitly denied, or
     *          `null` if the combination of policy, path and
     *          action is not governed by this collection. */
-  query (name: string, path: string, verb: string, ctx?: QueryContext): boolean | null {
-    const policy = this.get(name)
-    return policy !== undefined
-      ? policy.query(path, verb, ctx)
-      : null
-  }
+  query (name: string, path: string, verb: string, ctx?: QueryContext): boolean | null {}
 
   /** Check whether a path is governed by a policy in this collection.
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] EqualityOperator
src/policymap.ts:29:12
     *          action is not governed by this collection. */
   query (name: string, path: string, verb: string, ctx?: QueryContext): boolean | null {
     const policy = this.get(name)
-    return policy !== undefined
+    return policy === undefined
       ? policy.query(path, verb, ctx)
       : null
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] ConditionalExpression
src/policymap.ts:29:12
     *          action is not governed by this collection. */
   query (name: string, path: string, verb: string, ctx?: QueryContext): boolean | null {
     const policy = this.get(name)
-    return policy !== undefined
+    return false
       ? policy.query(path, verb, ctx)
       : null
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BlockStatement
src/policymap.ts:38:69
     * @param name Policy to be queried.
     * @param path Path to be checked.
     * @param ctx Query context for resolving context-dependent paths. */
-  matches (name: string, path: string, ctx?: QueryContext): boolean {
-    const policy = this.get(name)
-    return policy !== undefined
-      ? policy.matches(path, ctx)
-      : false
-  }
+  matches (name: string, path: string, ctx?: QueryContext): boolean {}
 
   /** Static constructor function; returns a new PolicyMap. */
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] ConditionalExpression
src/policymap.ts:40:12
     * @param ctx Query context for resolving context-dependent paths. */
   matches (name: string, path: string, ctx?: QueryContext): boolean {
     const policy = this.get(name)
-    return policy !== undefined
+    return true
       ? policy.matches(path, ctx)
       : false
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BooleanLiteral
src/policymap.ts:42:9
     const policy = this.get(name)
     return policy !== undefined
       ? policy.matches(path, ctx)
-      : false
+      : true
   }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap

[Killed] BlockStatement
src/policymap.ts:46:49
   }
 
   /** Static constructor function; returns a new PolicyMap. */
-  static for (...policies: Policy[]): PolicyMap {
-    return new PolicyMap(...policies)
-  }
+  static for (...policies: Policy[]): PolicyMap {}
 }
 
killedBy: All tests
statusReason: > @spacl/core@1.2.1 test
> jest test/*.ts


FAIL test/policymap.ts

  policymap
